{
    "Successful Candidate Profile": [
        {
            "ResumeIndex": 0,
            "ResumeJSON": {
                "Education": "Princeton, NJ Princeton University Sept 2013-June 2017\nMajor: Electrical Engineering, B.S.E (in-major GPA: 3.44). Certificate (Minor): Computer Science. Programming Coursework: Algorithms & Data Structures, Operating Systems, Networks, Computer Vision. EE Coursework: Embedded Systems, IoT, Computer Arch., Circuits, Logic Design, VLSI Design, Signal Processing.",
                "Experience": "Firmware Engineer, Intern Stryd (startup) June-Aug 2016\nFoot pod (www.stryd.com): Wearable Power Meter For Running. Improved device's battery lifespan by 8% by integrating a fuel gauge sensor and establishing a battery saving state. Utilized the I2C protocol to implement a device driver for the fuel gauge and used it to create a low power state. Increased available flash memory by 66% through redesigning the flash data storage system with a circular buffer implementation that supported variable-sized records. Leveraged knowledge in Git, ARM Cortex-M4 architecture, programmed in C using Keil IDE, and debugged using an Oscilloscope, Multimeter, Memory Analyzer, and JTAG/SWD debugging interface.\nSoftware Developer, Intern Autodesk June-Aug 2015\nTinkerCad (www.tinkercad.com): online 3D design and printing tool. Integrated multi-touch gestures for 3D workspaces by creating a deterministic finite state machine for HTML events. Implemented a low-pass and smoothing function to allow for a user-friendly touch experience. Established remote testing and coding development environment using Docker and bash scripts. Leveraged knowledge in Full Stack Web development, JavaScript, Git, and debugged using Chrome Developer Tools.",
                "Skills": "Software: (proficient): C, Python, Swift, Unix, Git (familiar): Java, C++, Go, SQL, Matlab, JavaScript, HTML/CSS.",
                "Projects": "Personal Website: www.terrencekuo.com (for additional information and projects).\niOS Meme App: Developed an iOS application using Swift and Objective-C that allows users to easily create and share memes. Integrated openCV library allowing users to effortlessly apply photo filters and effects. Incorporated persistent data storage to archive memes. Leveraged caching for recently accessed memes. Designed RESTful backend server enabling memes to be stored persistently in an online database. Utilized: Swift, Obj-C, Local Persistent Data, Caching, Cloud Storage, Python, Flask, SQLite, openCV.\nAutonomous RC Car + Virtual Driving: Designed and implemented PID speed control for an RC car by constructing a Hall effect circuit to measure speed and a PWM motor controller circuit to control speed. Added autonomous driving by constructing an image processing circuit and implementing PID steering control. Created a ‘virtual driving experience’ by manufacturing a gimbal mount and creating an iOS app that wirelessly displays and operates the cameras FOV and direction. The app also remotely controls speed and steering. Utilized: C programming, PSoC, Socket (IP/TCP) Programming, O-scope, Multimeter, Arduino, Web & iOS Dev.\nHome Automation: Temperature Sensor with Android Interface: Created an Android App that bit-banged BeagleBone’s I2C module to read temperature data off the DS1621 digital thermometer sensor and visualized temperature changes. Utilized: C programming, BeagleBone Microcontroller, Oscilloscope, Circuit Design, Android Development.\nReal-Time Interactive 3D-Graphics Website (http://interactive-graphics.herokuapp.com): Developed an interactive graphics website using THREE.js to create a 3D workspace with real-time animated 3D models of crystal lattice structures and robotic parts in which animations and camera views can be manipulated. Inspired from struggling with visualizing 3D models while taking a materials science class. Utilized: Python, Flask, Heroku, JavaScript, AJAX, THREE.js, HTML/CSS, Docker, GIT.",
                "Title": "SDE"
            }
        },
        {
            "ResumeIndex": 1,
            "ResumeJSON": {
                "Education": "UNIVERSITY OF WATERLOO\u2028Bachelor of Science - BS, Theoretical and Mathematical Physics (2019 - 2024)\nK.R. MANGALAM WORLD SCHOOL\u2028High School Diploma",
                "Experience": "UNIVERSITY OF WATERLOO\u2028Data Science Researcher, January 2024 - Present (11 months), Waterloo, Ontario, Canada\u2028Working at Prof. Marek Stastna's Fluid Lab in the Department of Applied Mathematics.\nENVIRONMENT AND CLIMATE CHANGE CANADA\u2028Data Scientist, May 2023 - September 2023 (5 months), Ottawa, Ontario, Canada. Software Developer, January 2023 - April 2023 (4 months), Gatineau, Quebec, Canada. Software Developer, September 2022 - December 2022 (4 months), Gatineau, Quebec, Canada.\nUNIVERSITY OF WATERLOO\u2028Undergraduate Research Assistant, May 2022 - May 2023 (1 year 1 month), Waterloo, Ontario, Canada. Working at Prof. Kevin Lamb’s Fluid Lab in the Department of Applied Mathematics.\nONTARIO MINISTRY OF GOVERNMENT AND CONSUMER SERVICES\u2028Web Developer and Designer, January 2022 - May 2022 (5 months), Toronto, Ontario, Canada.\nUNIVERSITY OF WATERLOO\u2028Undergraduate Teaching Assistant (WEEF TA), September 2021 - December 2021 (4 months), Waterloo, Ontario, Canada.\nYUJA\u2028Software Developer, January 2021 - April 2021 (4 months).\nVIRTIBOT\u2028Co-Founder, October 2020 - December 2020 (3 months), India.\nCOOLAGE APP\u2028Web Developer, June 2020 - August 2020 (3 months).\nWOMENFORINDIA\u2028Social Work Intern, June 2020 - July 2020 (2 months), Delhi, India.",
                "Skills": "NumPy, Natural Language Processing (NLP), Generative AI, SQL, R, Python, Tensorflow, Git, AWS",
                "Projects": "Developed OCR software using OpenCV in Python to extract data from foreign permits, implemented preprocessing pipelines to handle variations in text such as font, size, and orientation, optimized disk space by creating file compression software in Python saving 40% disk space, and improved OCR accuracy for 10k+ permits, resulting in time and cost savings.\nDeveloped a user-centric website in WordPress, integrating Bootstrap for widgets and components, analyzed page views and interactions using Google Analytics to improve the website's structure, automated data summarization with Excel, reducing manual work by 40%, and applied agile frameworks for website versioning and UI enhancements with Adobe tools.\nTutored Linear Algebra, Physics, and Calculus, solving doubts for hundreds of students. Conducted over 30 help sessions, engaging students and teaching core concepts. Critiqued more than 35 resumes and supported students with the co-op process.\nConducted over 1000 test cases for software performance improvements, resolved more than 30 bug reports, automated testing using Java, Selenium, and Git, and enhanced API testing efficiency with Postman and automated test creation in Typescript.\nBuilt the company website with WordPress, HTML5, and CSS3. Leveraged AI and ML for chatbot and video-bot development. Expanded the company's online presence through networking skills.\nCreated website components using React, Bootstrap, and HTML/CSS. Managed a team of 5-8 interns and launched a project for the \"Make in India\" campaign.\nCollaborated with a national team to provide COVID-19 support solutions and raised funds to assist healthcare and law enforcement personnel.",
                "Title": "DS"
            }
        },
        {
            "ResumeIndex": 2,
            "ResumeJSON": {
                "Education": "University of Toronto\u2028Master of Science - MS, Applied Computing (Data Science) (2020 - 2022)\nSRM University\u2028Bachelor of Technology - BTech, Computer Science and Engineering (2016 - 2020)",
                "Experience": "Guidepoint\u2028AI Engineer, June 2024 - Present (6 months), Toronto, Ontario, Canada\nSAP\u20282 years 6 months\u2028Senior Machine Learning Engineer, March 2024 - June 2024 (4 months), Toronto, Ontario, Canada\u2028Responsible for strategic leadership and collaborative decision-making in guiding machine learning product development and shaping team processes with a focus on operational efficiency and mentorship, alongside cross-functional efforts with data science, architecture, business, and sales.\nSpecialist Machine Learning Engineer III, April 2023 - March 2024 (1 year), Toronto, Ontario, Canada\u2028Initiated and led e-commerce machine learning product development from concept to deployment. Championed engineering best practices and led automation initiatives for testing and deployment of ML services. Provided mentorship and facilitated partnerships with other big technology companies including Microsoft and Databricks to optimize data processes.\nSpecialist Machine Learning Engineer II, January 2022 - March 2023 (1 year 3 months), Toronto, Ontario, Canada\u2028Led the development and deployment of a replenishment recommendation feature, enhancing sales performance across numerous enterprises. Engineered a real-time intrusion detection service to evaluate the threats for billions of login and registration requests every month for our enterprise customers. Promoted test-driven development best practices. Recognized for exceptional contributions in innovation and demo presentations within a large group of engineering professionals.\nICICI Bank Canada\u2028Data Science Consultant, May 2021 - December 2021 (8 months), Toronto, Ontario, Canada\u2028Implemented an Azure ETL pipeline for evaluating telephonic sales pitches at ICICI Bank, reducing transcription times by 75%, and fine-tuned a transformer-based model, decreasing poor customer reviews by a third.\nPersistent Systems\u2028Data Science Intern, December 2019 - March 2020 (4 months), Pune, Maharashtra\u2028Developed a full-stack Essay Grading System leveraging NLP for feature extraction and neural networks, complete with a user interface for essay submission and grading.\nReliance Industries Limited\u2028Data Science Intern, December 2018 - January 2019 (2 months), Navi Mumbai, India\u2028Analyzed Reliance’s logistics data to identify KPIs, managed project lifecycle from data wrangling to visualization, and developed live dashboards for real-time fleet monitoring, saving time and costs.",
                "Skills": "Continuous Integration and Continuous Delivery (CI/CD), Data Engineering, MLOps, Machine Learning, Data Science, Long Short-Term Memory (LSTM), Natural Language Processing (NLP), BERT",
                "Projects": "Effects of COVID-19 Induced Lockdown on Mobility Pattern and Subsequently, on Case Counts\u2028Sep 2020 - Jan 2021\nAssociated with: University of Toronto\nThis project was submitted for Canadian Statistical Science Institute's Biostatistics COVID-19 Case Study competition.\nThe goal of this project was to investigate the relationship between Google's mobility data and the number of new cases of COVID-19.\nHaving understood the link between mobility and the increase in COVID-19 cases, policymakers can leverage this information when deciding on the most important plan of action (e.g., closing schools may have a greater impact than closing pharmacies).\nWe determined both the direction (positive/negative) and strength of the relationships between mobility data and new cases.\n\nRecommender System - Predicting User Ratings on Amazon\u2028Nov 2020 - Dec 2020\nAssociated with: University of Toronto\nTuned the pre-trained BERT model from Huggingface to perform linear regression for predicting user ratings on Amazon.\nAchieved a top position in the in-class Kaggle competition for CSC2515.",
                "Title": "MLE"
            }
        }
    ]
}