{
    "JobDescriptions": [
        {
            "JDIndex": 0,
            "JDJSON": {
                "Role": "Design, build, and maintain highly scalable, robust, and efficient cloud infrastructure using Google Cloud Platform (GCP) services, including Vertex AI, BigTable, BigQuery, and Cloud Composer. Develop automation and orchestration of ML pipelines, integrating data ingestion, feature engineering, training, and deployment processes. Collaborate with cross-functional teams to understand their needs and build solutions that improve platform usability, scalability, and the overall development experience. Optimize data processing pipelines and cloud resources to ensure low-latency, cost-effective operation. Implement monitoring, alerting, and failover strategies to ensure platform reliability. Stay updated with industry trends and best practices in cloud engineering, data engineering, and machine learning",
                "Qualification": "Customer-centric mindset: Passionate about delivering an exceptional experience for data scientists through a self-service platform, reducing friction in their workflows. Collaboration: Strong communication skills to work closely with cross-functional teams, including data scientists and engineers, to ensure platform features meet user needs and expectations. Problem-solving: Ability to identify and solve complex technical issues related to ML pipelines, cloud infrastructure, and scalability, ensuring an efficient and robust platform. Automation-first approach: Commitment to streamlining and automating processes for scalability and reliability, enabling data scientists to focus on experimentation and model development. Adaptability: Ability to quickly adjust to new technologies and evolving platform needs to keep the infrastructure cutting-edge and efficient. Ownership and initiative: Comfortable taking ownership of key platform components, driving innovation and improvements that benefit the platform’s scalability and usability. Bachelor’s or Master’s degree in Computer Science, Engineering, or a related field. 2+ years of experience in software engineering with a focus on cloud infrastructure and/or data engineering. Hands-on experience with Google Cloud Platform services such as Vertex AI, BigTable, BigQuery, Cloud Composer, Cloud Storage, etc. Proficiency in one or more programming languages such as Python, Java, and SQL. Experience with orchestration tools such as Apache Airflow (Composer). Knowledge of CI/CD pipelines and DevOps tools for continuous integration and deployment. Familiarity with containerization and orchestration (Docker, Kubernetes). Strong problem-solving skills and attention to detail. Excellent communication skills and ability to work in a collaborative, fast-paced environment",
                "Title": "SDE"
            }
        },
        {
            "JDIndex": 1,
            "JDJSON": {
                "Role": "Develop advanced analytics and predictive models from design through implementation in the areas of pricing and promotion, marketing, merchandising, and other areas of the business as needed. Participate in the research of analytical methods to find or advance solutions to business problems. Clearly and concisely explain complex analytical findings to non-analytical peers and business leaders. Create analytic datasets in collaboration with data engineering teams that involves data querying, cleaning, transformation, and feature engineering. Define requirements and test cases for Data validation and monitoring. Author programming code (e.g., SQL, Python, R, spark) to assemble and analyze data, following/establishing/enhancing organizational standards and coding practices including code management (i.e. Documentation, use ofGit Hub). Lead and participate in peer code reviews for QA/QC/standards compliance. Train/Mentor other team members, provide developmental support where necessary. Follow defined project management processes. Actively participate in project plan development and agile ceremonies (development of backlog, sprint planning, daily standups, retros/reviews) and documentation.",
                "Qualification": "Education: Bachelor’s degree required, preferably with a quantitative focus (Statistics, Business Analytics, Data Science, Math, Economics, etc.). Master’s degree preferred. Masters + 1year / Bachelors + 2 years of experience in a data science/advanced analytics role, or demonstrated ability to perform job functions via academic project/internship experience. Knowledge And Skills: Demonstrated knowledge of SQL, R and Python; Experience querying large datasets using SparkSQL or PySpark; Experience with ML frameworks such as scikit-learn, Tensorflow, Keras, Pytorch, etc.; Exposure with software development practices, object-oriented principles and test automation; Exposure to version control systems such as Git – experience preferred. Experience with cloud-based analytics environments (Azure, AWS or GCP); Experience applying operational research, statistical and machine learning techniques such as regression, time series forecasting, clustering, optimization, etc.; Exposure to agile methodologies using project planning and tracking management tools e.g., JIRA; experience preferred. Strong problem-solving skills and ability to troubleshoot complex distributed systems; Strong interpersonal skills, including the ability to communicate the business benefits of analytics; Availability to travel up to 10% of the time",
                "Title": "DS"
            }
        },
        {
            "JDIndex": 2,
            "JDJSON": {
                "Role": "You will be part of the central SAP AI Development Unit and support our customers with the adoption of SAP Business AI solutions, helping them to improve their business results based on latest machine learning technology. In this role you work closely with our development teams and the customer to achieve high value propositions and apply machine learning technology in the daily work of our customers. As a (Senior) Development Project Consultant you guide and steer customer and internal teams to achieve state of the art machine learning solutions.This position requires the ability to work and communicate in a dynamic, interdisciplinary, and intercultural team in an agile and efficient way. As a thought leader in Machine Learning you appreciate the possibility for learning and personal development and therefore you keep track of the latest developments and share your knowledge actively with others. You will be working with and leading teams to successful projects in the context of Machine Learning Technology.",
                "Qualification": "Degree in Mathematics, Physics, Computer Science, Data Science. Several years relevant work experience in sales or technical oriented customer projects. Experienced in guiding customer interactions up to C Level. Good Overview of Machine Learning Trends and Technology. Experience in implementation of Machine Learning solutions and platforms. Knowledge and experience in Machine Learning Programming Frameworks, like TensorFlow or scikit. Programming Skills, like ABAP, Java, Python, JavaScript, NodeJS, Jupyter Notebook, ABAP. Database Knowledge. Web and Cloud Computing Knowledge. Ideally SAP technology and SAP system integration technology. Fluency in English AND German (written and spoken language).",
                "Title": "MLE"
            }
        }
    ]
}