[
    {
        "job_title": "SDE",
        "resume": {
            "Education": "York University Bachelor of Science (BSc) in Computer Science (January 2024 - April 2026) Sheridan College Associate's Degree in Computer Software Engineering (January 2021 - April 2022)",
            "Experience": "AI Programming Trainer at Data Annotation (June 2024 - Present) Evaluates and rates AI-generated coding prompts across multiple programming languages. Provides feedback to refine and optimize AI algorithms. Collaborates with cross-functional teams to enhance AI-driven solutions. Software Developer & Robotics Programmer at Kuntz Electroplating Inc. (KEI) (September 2023 - January 2024) Developed an ASP.NET web interface for scrap inventory management using C#, PostgreSQL, HTML, CSS, JavaScript, and JQuery. Engineered a Python-based door access management system with Raspberry Pi and RFID. Designed web interfaces for security administrators and automated Excel report generation with VBA.",
            "Skills": "Programming Languages: C#, C, C++, JavaScript, HTML, CSS, Python, SQL Frameworks & Tools: Angular, .NET, REST, jQuery, Spring, Bootstrap, GitHub, Direct3D Methodologies: Agile, Scrum Soft Skills: Adaptable, Creative, Disciplined, Detail-Oriented, Organized",
            "Projects": "No specific projects were listed in the provided resume, though detailed work experience includes project-related tasks."
        },
        "job_description": {
            "Role": "Come up with diverse problems and solutions for a coding chatbot Write high-quality answers and code snippets Evaluate code quality produced by AI models for correctness and performance",
            "Qualification": "Fluency in English (native or bilingual level) Proficient in either Python and/or JavaScript Excellent writing and grammar skills A bachelor's degree (completed or in progress) Previous experience as a Software Developer, Coder, Software Engineer, or Programmer"
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "Princeton, NJ Princeton University Sept 2013-June 2017 Major: Electrical Engineering, B.S.E (in-major GPA: 3.44). Certificate (Minor): Computer Science. Programming Coursework: Algorithms & Data Structures, Operating Systems, Networks, Computer Vision. EE Coursework: Embedded Systems, IoT, Computer Arch., Circuits, Logic Design, VLSI Design, Signal Processing.",
            "Experience": "Firmware Engineer, Intern Stryd (startup) June-Aug 2016 Foot pod (www.stryd.com): Wearable Power Meter For Running. Improved device's battery lifespan by 8% by integrating a fuel gauge sensor and establishing a battery saving state. Utilized the I2C protocol to implement a device driver for the fuel gauge and used it to create a low power state. Increased available flash memory by 66% through redesigning the flash data storage system with a circular buffer implementation that supported variable-sized records. Leveraged knowledge in Git, ARM Cortex-M4 architecture, programmed in C using Keil IDE, and debugged using an Oscilloscope, Multimeter, Memory Analyzer, and JTAG/SWD debugging interface. Software Developer, Intern Autodesk June-Aug 2015 TinkerCad (www.tinkercad.com): online 3D design and printing tool. Integrated multi-touch gestures for 3D workspaces by creating a deterministic finite state machine for HTML events. Implemented a low-pass and smoothing function to allow for a user-friendly touch experience. Established remote testing and coding development environment using Docker and bash scripts. Leveraged knowledge in Full Stack Web development, JavaScript, Git, and debugged using Chrome Developer Tools.",
            "Skills": "Software: (proficient): C, Python, Swift, Unix, Git (familiar): Java, C++, Go, SQL, Matlab, JavaScript, HTML/CSS.",
            "Projects": "Personal Website: www.terrencekuo.com (for additional information and projects). iOS Meme App: Developed an iOS application using Swift and Objective-C that allows users to easily create and share memes. Integrated openCV library allowing users to effortlessly apply photo filters and effects. Incorporated persistent data storage to archive memes. Leveraged caching for recently accessed memes. Designed RESTful backend server enabling memes to be stored persistently in an online database. Utilized: Swift, Obj-C, Local Persistent Data, Caching, Cloud Storage, Python, Flask, SQLite, openCV. Autonomous RC Car + Virtual Driving: Designed and implemented PID speed control for an RC car by constructing a Hall effect circuit to measure speed and a PWM motor controller circuit to control speed. Added autonomous driving by constructing an image processing circuit and implementing PID steering control. Created a ‘virtual driving experience’ by manufacturing a gimbal mount and creating an iOS app that wirelessly displays and operates the cameras FOV and direction. The app also remotely controls speed and steering. Utilized: C programming, PSoC, Socket (IP/TCP) Programming, O-scope, Multimeter, Arduino, Web & iOS Dev. Home Automation: Temperature Sensor with Android Interface: Created an Android App that bit-banged BeagleBone’s I2C module to read temperature data off the DS1621 digital thermometer sensor and visualized temperature changes. Utilized: C programming, BeagleBone Microcontroller, Oscilloscope, Circuit Design, Android Development. Real-Time Interactive 3D-Graphics Website (http://interactive-graphics.herokuapp.com): Developed an interactive graphics website using THREE.js to create a 3D workspace with real-time animated 3D models of crystal lattice structures and robotic parts in which animations and camera views can be manipulated. Inspired from struggling with visualizing 3D models while taking a materials science class. Utilized: Python, Flask, Heroku, JavaScript, AJAX, THREE.js, HTML/CSS, Docker, GIT."
        },
        "job_description": {
            "Role": "Design, build, and maintain highly scalable, robust, and efficient cloud infrastructure using Google Cloud Platform (GCP) services, including Vertex AI, BigTable, BigQuery, and Cloud Composer. Develop automation and orchestration of ML pipelines, integrating data ingestion, feature engineering, training, and deployment processes. Collaborate with cross-functional teams to understand their needs and build solutions that improve platform usability, scalability, and the overall development experience. Optimize data processing pipelines and cloud resources to ensure low-latency, cost-effective operation. Implement monitoring, alerting, and failover strategies to ensure platform reliability. Stay updated with industry trends and best practices in cloud engineering, data engineering, and machine learning",
            "Qualification": "Customer-centric mindset: Passionate about delivering an exceptional experience for data scientists through a self-service platform, reducing friction in their workflows. Collaboration: Strong communication skills to work closely with cross-functional teams, including data scientists and engineers, to ensure platform features meet user needs and expectations. Problem-solving: Ability to identify and solve complex technical issues related to ML pipelines, cloud infrastructure, and scalability, ensuring an efficient and robust platform. Automation-first approach: Commitment to streamlining and automating processes for scalability and reliability, enabling data scientists to focus on experimentation and model development. Adaptability: Ability to quickly adjust to new technologies and evolving platform needs to keep the infrastructure cutting-edge and efficient. Ownership and initiative: Comfortable taking ownership of key platform components, driving innovation and improvements that benefit the platform’s scalability and usability. Bachelor’s or Master’s degree in Computer Science, Engineering, or a related field. 2+ years of experience in software engineering with a focus on cloud infrastructure and/or data engineering. Hands-on experience with Google Cloud Platform services such as Vertex AI, BigTable, BigQuery, Cloud Composer, Cloud Storage, etc. Proficiency in one or more programming languages such as Python, Java, and SQL. Experience with orchestration tools such as Apache Airflow (Composer). Knowledge of CI/CD pipelines and DevOps tools for continuous integration and deployment. Familiarity with containerization and orchestration (Docker, Kubernetes). Strong problem-solving skills and attention to detail. Excellent communication skills and ability to work in a collaborative, fast-paced environment"
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "The University of British Columbia Bachelor's Degree in Combined Major in Computer Science and Business with Co-op",
            "Experience": "Software Engineer at Citi (July 2021 - Present) Improved code quality, achieving a 15% reduction in code smells and a 10% reduction in duplications through SonarQube analysis and refactoring. Enhanced implementation time for application preferences by 50% via streamlined data retrieval services and API endpoints. Increased code coverage by 20% using Jest for unit testing. Contributed to UI, feature enhancements, and bug fixes for banking client applications and trading platforms. Migrated legacy code to Angular web components and resolved CSS issues. Software Developer at ICBC (September 2020 - December 2020) Developed RESTful API endpoints using Java Spring Boot. Modernized legacy applications for cross-browser compatibility and HTTPS protocol. Provided incident support for insurance claims portals, ensuring system uptime. Software Developer at Bizkinnect LLC (May 2020 - July 2020) Created responsive ReactJS UI with SASS styling. Designed relational databases and optimized data queries. Developed high-performing RESTful API endpoints and integrated GCP services for enhanced functionality. Business Analyst Intern at ECENTA (May 2019 - August 2019) Automated input validation using Python scripts. Conducted user acceptance testing and configured SAP systems to meet client needs. Tracked and resolved user stories and defects using JIRA. Server at Sushi Tengoku (April 2017 - September 2017) Ensured guest satisfaction through efficient service and order management. Trained new employees and managed payment transactions. Pharmacist Assistant at London Drugs (June 2015 - September 2015)",
            "Skills": "Technical: TypeScript, React, Redux, CSS, HTML, Angular, Java Spring Boot, NodeJS, RESTful APIs, MySQL, Python, SASS, Git, Jenkins Soft Skills: Collaboration, Teamwork, Problem-Solving, User Experience Design",
            "Projects": ""
        },
        "job_description": {
            "Role": "Conduct tasks related to feasibility studies, time and cost estimates, IT planning, risk technology, applications development, model development, and establish and implement new or revised applications systems and programs to meet specific business needs or user areas Monitor and control all phases of development process and analysis, design, construction, testing, and implementation as well as provide user and operational support on applications to business users Utilize in-depth specialty knowledge of applications development to analyze complex problems/issues, provide evaluation of business process, system process, and industry standards, and make evaluative judgement Recommend and develop security measures in post implementation analysis of business usage to ensure successful system design and functionality Consult with users/clients and other technology groups on issues, recommend advanced programming solutions, and install and assist customer exposure systems Ensure essential procedures are followed and help define operating standards and processes Serve as advisor or coach to new or lower level analysts Has the ability to operate with a limited level of direct supervision. Can exercise independence of judgement and autonomy. Acts as SME to senior stakeholders and /or other team members. Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.",
            "Qualification": "5-8 years of relevant experience Experience in systems analysis and programming of software applications Experience in managing and implementing successful projects Working knowledge of consulting/project management techniques/methods Ability to work under pressure and manage deadlines or unexpected changes in expectations or requirements"
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "University of New Haven Master of Science - MS, Data Science Aug 2022 - May 2024\nVellore Institute of Technology Bachelor of Technology - BTech, Computer Science and Engineering 2015 - 2019\nActivities and societies: Style Check Board Member | Event Organizer - Reviera 2017 | TeDX: Empowering important needs in modern society\nCourses - Databases Management, Data Mining, Artificial Intelligence, Machine Learning, NLP, Data Structure and Algorithms, Calculus, Statistics and Probability\nAmity International School, Saket Science, CBSE CLASS 12 2014 - 2015\nActivities and societies: School Prefect for 2012-14 | School Soccer Captain",
            "Experience": "SDE 2 Amazon - Full-time Nov 2024 - Present - 1 mo New York City Metropolitan Area\nData Scientist WelSpot - Internship Jan 2024 - May 2024 - 5 mos New York, United States - Remote LinkedIn helped me get this job\nMachine Learning Engineer University of New Haven - Full-time Jan 2023 - Dec 2023 - 1 yr West Haven, Connecticut, United States - On-site\nData Scientist Saarthee - Full-time Jan 2022 - Aug 2022 - 8 mos Gurugram, Haryana, India\nCBRE Full-time - 2 yrs 9 mos Software Engineer Jan 2020 - Jan 2022 - 2 yrs 1 mo Gurugram, Haryana, India\nAssociate Software Engineer - SQL Developer May 2019 - Jan 2020 - 9 mos Gurgaon, Haryana, India\nIntern - Analyst Wisethink Information Solutions Pvt. Ltd. - Internship May 2018 - Aug 2018 - 4 mos India",
            "Skills": "Communication, Extract, Transform, Load (ETL), SQL, Data Science, Python (Programming Language), Machine Learning, Natural Language Processing (NLP)",
            "Projects": "Document Summarization and Text Classification Developed an application for document summarization and text classification. Purpose and Goals: Simplify text analysis tasks for users. Overview of Technologies Used: Flask, Hugging Face Transformers, spaCy, TextBlob, etc. Used DistilBERT model for classification and BART model for summarization.\nMCQify MCQify is a web application designed to simplify the process of creating and managing multiple-choice questions (MCQs) for educators, students, and professionals. It provides an intuitive interface for generating, organizing, and storing MCQs, making it easier to create quizzes, exams, and practice tests. It generates MCQs from multiple inputs: images, PDFs, audio, URLs, YouTube videos, and plain text."
        },
        "job_description": {
            "Role": "You will build new software services and tools from scratch and improve existing systems. You will create simple solutions for complex business and operational problems. You will design and implement scalable solutions and solve complex problems. You will learn how to build robust solutions that operate at Amazon scale. You will have the opportunity to design systems, take mission critical decisions on how we design production systems, what technology to use and how to solve problems. You will get opportunity to work with senior technical leaders to review and improve your designs and solutions.",
            "Qualification": "Basic Qualifications: 3+ years of non-internship professional software development experience. 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience. Experience programming with at least one software programming language. Preferred Qualifications: 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience. Bachelor's degree in computer science or equivalent."
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "Mangalam College of Engineering Bachelor of Technology - BTech, Computer Engineering   Aug 2009 - Jul 2013 Grade: First Class   Activities and Societies: Cultural competitions    NPower Canada UX/UI Design   Feb 2022 - May 2022",
            "Experience": "**TD**   Permanent Full-time · 2 yrs 7 mos   Toronto, Ontario, Canada    **Software Engineer**   May 2022 - Present · 2 yrs 7 mos    - REST APIs, Spring Boot, and +2 skills    **Java Developer**   May 2022 - Present · 2 yrs 7 mos    - Working on cutting-edge technologies to develop products.   - Java    ---  **Frontend Developer**   Freelance   Mar 2021 - May 2021 · 3 mos    - Took initiative to work on a website using HTML, CSS, JavaScript for a family-owned business and hosted the site within 2 months, which increased sales by 20%.   - Communicated with the client to determine the website design and layout by researching customer demographics and identifying user needs.   - Worked independently on website projects and upgrades to ensure quality and ongoing client satisfaction.   - Edited 30-40 images and content as per client requests for the new layout of the site.   - Designed a responsive interface that works on different device form factors.    ---  **Software Engineer**   Hages Business Solutions Pvt Ltd (HBS) · Permanent Full-time   Oct 2015 - Oct 2016 · 1 yr 1 mo   India    - Collaborated with a team of 5 developers to run test cases for debugging customer-reported bugs.   - Created technical documentation for customer reference and internal use for future modifications.   - Produced requirement specification documents for new projects after sufficient research.    ---  **Junior Software Engineer**   Maanav Info Solutions, Kerala · Permanent Full-time   Aug 2014 - Aug 2015 · 1 yr 1 mo   India    - Compiled software solutions using C# and MySQL to design, develop, and implement sales and distribution applications.   - Defined and documented technical specifications for final project delivery to ensure ease of application usage.   - Conducted user testing sessions to identify design problems and devise effective solutions.   - Teamed up with developers and managers throughout all stages of the production cycle to ensure smooth communication and seamless delivery of the final product.",
            "Skills": "REST APIs, Spring Boot, Java, Spring Framework, ,Front-End Development, React.js, Software Development, HTML5, Cascading Style Sheets (CSS), JavaScript, SQL",
            "Projects": "Took initiative to work on a website using HTML, CSS, JavaScript for a family-owned business and hosted the site within 2 months, which increased sales by 20%. Designed a responsive interface that works on different device form factors. Collaborated with a team of 5 developers to run test cases for debugging customer-reported bugs. Produced requirement specification documents for new projects after sufficient research. Compiled software solutions using C# and MySQL to design, develop, and implement sales and distribution applications. Defined and documented technical specifications for final project delivery to ensure ease of application usage."
        },
        "job_description": {
            "Role": "Design and develop efficient upstream and downstream interfaces to and from Murex system. Write efficient code that is maintainable and extensible. Build reusable code and libraries for future use. Optimize an existing and create new interfaces for maximize speed and scalability. Monitor and solve performance issues. Collaborate with business users and the development team in an Agile environment. Oversee and manage multiple strategic initiatives in a group.",
            "Qualification": "5+ years of Extensive experience in Core Java, Spring Integration, Spring boot, etc. 5+ years of Extensive experience in Unix shell scripting 5+ years JavaScript and node.js experience. 3+years in AngularJS Knowledge in React an asset. Extensive experience with JIRA, Confluence, Nexus, Jenkins, Maven Good understanding of version control and source code management using Git."
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "University of Toronto (UofT) September 2018 - June 2023 - Honours Bachelor of Science, double major in Computer Science and Statistics, Dean's List Scholar. - Admitted as UofT Scholar - awarded to the top ~4.5% of the incoming class; graduated with High Distinction.",
            "Experience": "University of Toronto Toronto, ON · Research Assistant September 2022 - April 2023 - Conducted a research project under Professor Scott Schwartz for a 'readings course' (thesis-like), primarily using PyTorch for models. - Quantified aleatoric (data) and epistemic (model) uncertainty in deep neural networks. - Investigated generative (likelihood-defining) neural networks with importance sampling to produce reliable parameter posteriors. --- Amazon Toronto, ON · SDE Intern May 2022 - August 2022 - Worked as a Software Development Engineer Intern on the FBA (Fulfillment by Amazon) inbounding team. - Created a scalable prototype for the next FBA seller experience, leveraging GraphQL, AWS services (Lambda, S3, AppSync, etc.), Java, and TypeScript. - Integrated websocket API into an existing FBA website (frontend), fully managed by custom infrastructure as code. - Provided actionable novel extensions for improved efficiency, such as latency reduction via service usage prediction and Lambda warmers. --- Advanced Micro Devices (AMD) Toronto, ON · SWE Intern May 2021 - May 2022 - Part of the Language Runtime Team of the Machine Learning Software Engineering Unit. - Developed novel language features for HIP-Compute (analogous to CUDA) and worked on infrastructure projects for HIP. - Utilized C++ to implement concurrency and image processing algorithms. - Wrote GPU kernels for various projects and worked extensively with the ROCm tech stack, focusing on HIP for compute tasks. --- Watchtower Robotics Boston, MA · SWE Intern (Machine Learning) May 2019 - August 2019 - Created and implemented a procedure involving an unsupervised label generation process and custom CNN. - Synthesized proprietary robot data with feature-engineered audio data to predict and label pipe features (e.g., joints) with 90%+ test set accuracy. - Reduced data analysis time by 50% and gained attention from an AI VC firm (Innospark). - Extensively utilized Scipy and sklearn for statistical analysis and implemented ML models using TensorFlow and Keras.",
            "Skills": "Python, C++, C, C#, Java, GraphQL, PostgreSQL, R, Stan, CSS/CSS3, JSX, ES6, JavaScript, TypeScript, Git, AWS, CMake, CUDA, HIP, ROCm, Clang, PyTorch, TensorFlow, SciPy, Keras, Sklearn, Tidyverse, cmdstanr, rstanarm, lme4, React.js, .NET, Bootstrap, Figma, Sketch, Adobe CC, Scalable Architectures, OOP, Statistical Modelling, Deep Learning, Generative Modelling, Agile Development",
            "Projects": "Diffusion on the Probability Simplex June 2023 - Published in ICML - SODS (International Conference on Machine Learning). - Created a novel diffusion model that handles discrete data on a probability simplex. - The probability simplex naturally provides an interpretation where points correspond to categorical probability distributions."
        },
        "job_description": {
            "Role": "The team is seeking an experienced engineer, who will build and support backend data pipelines, indexing systems, services and APIs. These systems are to be used by hundreds of internal and tens of thousands of self-serve external users. To be successful in this role, you will need to have a passion for backend, data and micro-services architecture and engineering.",
            "Qualification": "Basic Qualifications   3+ years of non-internship professional software development experience  2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience  Experience programming with at least one software programming language  Preferred Qualifications   3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience  Bachelor's degree in computer science or equivalent  Experience with Amazon Web Services  Experience mentoring junior engineers and interns  Experience building and managing large scale 24x7 infrastructure - with demonstrated results building high throughput distributed systems in large-scale distributed environments"
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "University of Waterloo   Master of Engineering - MEng, Electrical and Computer Engineering (Software Engineering)   2016 - 2018    University of Nottingham   Bachelor's Degree, Electrical and Electronics Engineering   2012 - 2016   - Grade: GPA 3.92   - Activities and Societies: IET   - First Class Honors",
            "Experience": "Senior Software Engineer   DoorDash · Permanent Full-time   Aug 2021 - Present · 3 yrs 4 mos   Toronto, Ontario, Canada · Hybrid   - Ads targeting & Ads billing team (2022.7 - present):     - Developed ads targeting by creating user profiles for serving ads and promotions, integrating data from multiple sources.     - Worked on ads billing and invoicing, calculating usage, and processing large streaming datasets.   - International Canada Growth team (2021.8 - 2022.6):     - Launched various features related to DoorDash's expansion across Canada.    ---  Amazon   Software Development Engineer II   Jan 2020 - Jul 2021 · 1 yr 7 mos   Toronto, Ontario, Canada    Software Development Engineer   Jul 2018 - Jan 2020 · 1 yr 7 mos   Toronto, Ontario, Canada   - Amazon Alexa Communications:     - Launched a real-time media processing platform based on Gstreamer in the Cloud, which powers the Alexa group calling feature.    ---  Teaching Assistant   University of Waterloo   Jan 2018 - Apr 2018 · 4 mos   Kitchener, Canada Area   - Courses: ECE.453/CS.447/CS.647    ---  Software Developer Internship   Amazon   May 2017 - Jul 2017 · 3 mos   Toronto, Canada Area   - SDE",
            "Skills": "Java, C++, PIC Microcontroller, Arduino, Analog Circuit Design, Digital Circuit Design, SPI and I2C Protocols, Android Studio, Leadership, Power Electronics, Microsoft Word, Microsoft  Excel",
            "Projects": "Final Year Project - SPI and I2C   Sep 2015 - Present   Associated with the University of Nottingham   - Supervised by Prof. John Crowe.   - Implemented software using Serial communication interfaces to connect sensors with microprocessors and developed hardware to build a simple microprocessor on a stripboard.   - Explored Serial Peripheral Interface (SPI), Inter-Integrated Circuit (I2C), and Universal Asynchronous Receiver/Transmitter (UART).   - Conducted laboratory sessions to teach Year 1 undergraduate students the usage of common serial interfaces.   - Details included sensor connections to microprocessors (PIC and Arduino), UART interface usage, and building a microprocessor (Arduino) on the stripboard.    ---  Delaunay Triangulations - C++ Project   Jan 2016 - May 2016   Associated with the University of Nottingham   - Used the incremental Bowyer-Watson algorithm to generate Delaunay Triangulations.   - Addressed related software engineering design issues.    ---  Five in a Row - JAVA Game Developed in NetBeans IDE   Mar 2016 - May 2016   Associated with the University of Nottingham   - Developed a program allowing two users to play 'Five in a Row' on the PC desktop.   - Created using Java in the NetBeans IDE.    ---  Using PIC18 to Control the SR Motor   Feb 2015 - May 2015   Associated with the University of Nottingham   - Controlled the SR motor through both hardware and software design."
        },
        "job_description": {
            "Role": "Develop, release and run large-scale web applications. Develop and define the backend architecture and tech stack for a product area. Improve performance, reliability, scalability and security for our backend systems. Be involved in transitioning our monolithic codebase to a microservice-based architecture. Completely disrupt logistics by tackling bleeding-edge, technical problems",
            "Qualification": "B.S., M.S., or PhD. in Computer Science or equivalent. 2+ years of industry experience. Prior experience working with backend tech stacks. Ability to analyze and improve efficiency, scalability, and stability of various system resources. Experience with service oriented architecture, writing REST API's, unit testing, and architectural design. Understanding of modern web stacks and architecture (HTTP, REST). Experience with SQL and NoSQL databases and other technologies (e.g. Postgres, Redis, Elasticsearch, RabbitMQ). Nice To Haves: Experience building large scale, real-time applications. Experience with Java/Kotlin. Contributor to open source projects"
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "University of Waterloo   Master of Engineering - MEng, Artificial Intelligence   Sep 2021 - Dec 2022",
            "Experience": "SDE 2   American Express · Permanent Full-time   Jul 2024 - Present · 5 mos   Toronto, Ontario, Canada · Hybrid    ---  Software Developer   BMO Capital Markets · Contract Full-time   Jul 2023 - Apr 2024 · 10 mos   Toronto, Ontario, Canada · Hybrid   - Managed source code using GitHub to streamline collaboration in cross-functional Agile teams, increasing code quality by 25% and speeding up development cycles.   - Automated software delivery processes using CI/CD pipelines integrated with Azure DevOps.   - Led the transition to Agile software development methodologies and implemented Test-Driven Development (TDD) practices using JUnit, improving code quality by 30%.   - Mentored a team of 2 to deliver scalable server-side programming solutions for the order management team.    ---  Software Developer   nanopay Corporation · Permanent Full-time   Jan 2023 - May 2023 · 5 mos   Toronto, Ontario, Canada · Hybrid   - Developed an online remittance application using nanopay's FOAM architecture to transfer funds across international borders.   - Programmed the rule engine in Java to implement business rules for payment solutions.   - Empowered users with an intuitive interface for managing database information based on authorization privileges.   - Implemented JWT authentication, enhancing security and reducing vulnerabilities by 40%, while ensuring industry compliance.   - Independently contributed to user stories by redesigning layouts, developing new components, and enhancing existing ones.   - University of Waterloo   Graduate Research Assistant   May 2022 - Dec 2022 · 8 mos   Waterloo, Ontario, Canada   - Contributed to a power-tracing cybersecurity project as a Full Stack developer.   - Designed and implemented an application to present insights about security devices, connectivity status, and external clients.   - Regularly updated backend data.    Graduate Teaching Assistant   May 2022 - Aug 2022 · 4 mos   - Delivered lectures, hands-on tutorials, and supported students in understanding complex DBMS concepts, MySQL, and query optimization.   - Provided constructive feedback to improve students' grasp of RDBMS concepts during office hours.    ---  Software Development Intern   Paltronica Inc. · Contract Part-time   May 2022 - Dec 2022 · 8 mos   - Built predictive models, performed data clustering, and developed recommendation systems using machine learning algorithms and tools.   - Trained and evaluated models with appropriate metrics.   - Developed a full-stack web app using ASP.NET (C#) with an MVC architecture for 4 microservices, featuring React.js as the frontend.",
            "Skills": "SQL, Java Database Connectivity (JDBC), and more. React.js, Data Structures, and more. Linux, SQL, and more. Pandas (Software), Django, Java, Bitbucket, Spring Batch, Spring Boot, Git, NumPy, Machine Learning",
            "Projects": "Vocational Colleges App   Aug 2017 - Present   - Involved in the requirement gathering, analysis, and specification phase of the project.    ---  Projects in Core Java   Apr 2017 - Present   - Developed mini-projects using concepts of Core Java and JDBC.   - Projects include:     - Login Module     - Quiz Module     - Tic Tac Toe    ---  Oracle Account Password Update   Mar 2019   Associated with Infosys   - Developed a backend application to update Oracle account passwords using .NET framework and Oracle Database.    ---  Bone Age Assessment with ML   Aug 2018   - Predicted Bone Age using various Machine Learning Algorithms and compared their efficiencies.    ---  Doctor's Clinic   Jun 2017   - Built an online management system for clinics, featuring online booking of appointments and scheduling."
        },
        "job_description": {
            "Role": "As part of our diverse tech team, you can architect, code and ship software that makes us an essential part of our customers’ digital lives.  Here, you can work alongside talented engineers in an open, supportive, inclusive environment where your voice is valued, and you make your own decisions on what tech to use to solve challenging problems.  American Express offers a range of opportunities to work with the latest technologies and encourages you to back the broader engineering community through open source.  And because we understand the importance of keeping your skills fresh and relevant, we give you dedicated time to invest in your professional development.  Find your place in technology of #TeamAmex.  We are building MARS – simple abbreviation that stands for Modern Accounts Receivable System, but the name symbolizes the scale and ambition of this effort. This is a gigantic effort to build a brand-new global AR platform that transforms many aspects of work at American Express across technology and business.  We are building the platform using an event driven micro services architecture. Looking to build a brand-new team to contribute to MARS development that augments a globally distributed team of engineers.  This role is for a java engineer located in Phoenix. This is a dream opportunity for any engineer wanting to be working on cutting edge technology and has enough challenging work to learn, contribute and impress. Our team works in an environment that promotes openness, experimentation, and debates. Winning arguments are always based on logic and never on seniority or title. Come join us to learn, contribute and teach.  Work closely with product managers and product owners  Work closely with a team of engineers to design, build, test and deploy.  Actively participate in the various engineering forums to learn from others as well as educate others.  Contribute meaningfully toward the continuous improvement of platform and practices.  Stays informed on the latest trends in the industry and at American Express and adopt them as needed",
            "Qualification": "3-5 years Java Experience. Familiarity with building reactive micro services is preferable. Knowledge of Spring Boot Experience with design and coding across one or more object-oriented platforms and languages.  Desirable to have cloud experience, especially Docker, Kubernetes and Microservice architecture.  Experience with the Reactive framework such as Spring Webflux or Vert.x.  Desirable to have experience with performance and monitoring tools e.g. Splunk, App Dynamics, Dynatrace.  Knowledge of automated build / continuous delivery, experience of Maven and Jenkins.  Hands-on experience with application design, software development and relational and noSQL databases.  Communicates effectively with Technical, Operational, and Business colleagues.  Must be proactive, enthusiastic, flexible, and results driven."
        }
    },
    {
        "job_title": "SDE",
        "error": "Unterminated string starting at: line 5 column 17 (char 2666)"
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "**University of Waterloo**   Master's Degree, Computer Science   **Sep 2014 - Aug 2016**    ---  **Dhirubhai Ambani Institute of Information and Communication Technology**   Bachelor of Technology (B.Tech), Computer Science   **Jul 2009 - May 2013**",
            "Experience": "**Senior Software Engineer**   **RBC Royal Bank Of Canada** · Permanent Full-time   **Jul 2020 - Present** · 4 yrs 5 mos   Toronto, Ontario, Canada · Hybrid   - Developed backend microservices to support client acquisition through API endpoints for KYC, identity verification, fraud detection, and account creation.   - Created REST APIs for retrieving credit and debit card transaction histories, used by millions daily.   - Collaborated with developers to design and implement RESTful API interfaces.   - Utilized Spring Boot and NestJS frameworks to build microservices.   - Conducted unit, integration, and performance testing to ensure high-quality code.    ---  **Agile Software Engineer**   **TribalScale** · Permanent Full-time   **Jul 2018 - Jun 2020** · 2 yrs   Toronto, Canada Area · On-site   - Built backend APIs for retrieving and booking gas and parking orders using Node.js and AWS tools (Lambda, Kinesis, DynamoDB).   - Developed a backend server for managing work allocations with Spring Boot, GraphQL, and Kotlin.   - Worked on an Android media player app for live radio stations and podcasts with over 2 million daily users.   - Employed Agile methodologies (Extreme Programming), including TDD and pair programming.   - Integrated Google's best practices for dependency injection (Dagger2) and architecture components.    ---  **Software Developer**   **TradeRev** · Permanent Full-time   **Oct 2016 - Jun 2018** · 1 yr 9 mos   Toronto, Canada Area · On-site   - Delivered features for TradeRev and Adesa Upstream Android apps used by thousands daily.   - Collaborated with product, design, and QA teams to refine requirements and prototypes.   - Developed offline features using Realm DB to enable offline Android app functionality.   - Implemented MVP architecture with best practices for software development.   - Conducted unit testing with Mockito and resolved critical issues like crashes and memory leaks.   - Trained junior Android developers and handled production issues.",
            "Skills": "Software Development, JSON, Spring Framework, Node.js, Jenkins, Java, Kafka, Postman API, MongoDB, REST APIs, Microservices, Maven, RxJava, Jenkins, Java, Kotlin, Android Development",
            "Projects": "**FireLock**   **May 2015 - Jul 2016**   Associated with the University of Waterloo   - Developed an Android lock library to securely re-authenticate users.    ---  **CPET - Cloud Price Estimation Tool**   **Feb 2015 - Apr 2015**   Associated with the University of Waterloo   - Built a utility tool to estimate the best pricing plan for running applications on the cloud based on resource requirements.    ---  **Crowdsourcing System for Multilingual Plagiarism Detection**   **Sep 2014 - Dec 2014**   Associated with the University of Waterloo   - Created a crowdsourcing platform to address machine translation limitations for identifying plagiarized documents across languages.   - Developed the front-end interface using PHP, JavaScript, and MySQL.    ---  **Ad-Filter Firefox Plugin**   **Mar 2013 - Apr 2013**   Associated with Lucent Technologies Bell Labs   - Modified the Ad-Block Plus plugin to block only inappropriate or embarrassing ads rather than all ads.   - Designed a specific filter list and enhanced the Ad-Block Plus functionality for targeted blocking.    ---  **Ad-Extraction Tool**   **Jan 2013 - Feb 2013**   Associated with Lucent Technologies Bell Labs   - Developed a tool to identify advertisements on webpages by extracting both image and textual ad content from a list of webpages."
        },
        "job_description": {
            "Role": "Design, develop, and maintain complex software applications using NodeJS, Kafka, MSSQL, REST & GraphQL APIs. Contribute to the architectural decisions and design patterns for new and existing systems Conduct thorough code reviews to ensure adherence to best practices, coding standards, and quality assurance protocols Work closely with product managers and other stakeholders to understand requirements and deliver solutions that enhance user experience Troubleshoot, debug, and optimize existing applications for performance and scalability Create and maintain comprehensive documentation for software design, development/maintenance processes and API documentation Manage the implementation of multiple concurrent initiatives of varying complexity in a time efficient manner. Monitor and control activities according to plan. Collaborate and contribute on cross-functional enterprise initiatives and manage the effective implementation of assigned deliverables. Establish strong working relationships across teams to build influence and impact with key partners. Contribute to ongoing administrative program activities as required.",
            "Qualification": "Must have: 3+ years experience in professional, production-grade software development working on highly-scalable, moderately complex projects 3+ years Experience building REST, GraphQL for APIs and Kafka applications using NodeJs Hands on with MSSQL database and skills for complex query optimization Strong experience working in an Agile environment, working with project teams to deliver small to largely complex projects Comfortable with presenting prototypes, enhancements and facilitating questions with insightful responses to a varying range of audiences (i.e., business sponsors, product owners, adjacent technical teams, etc.) during agile ceremonies, adhoc and/or when needed Strong written and verbal communication skills with the ability to work cross-functionally to articulate, measure and solve issues Nice-to-have: Experience with angular/react and non-relational databases (MongoDB, Redis) Experience with devops pipeline using github, jenkin, UCD and logs/monitoring tools like kibana, Dynatrace etc and openshift cloud platform Wealth Management industry experience related to business processes and workflows."
        }
    },
    {
        "job_title": "SDE",
        "error": "Unterminated string starting at: line 5 column 17 (char 3170)"
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "University of Waterloo Bachelor of Computer Science, Honours, Computer Science 2016 - 2020 - Activities and Societies: - Chairman of Book Club - Computer Science Club (CSC)",
            "Experience": "Software Engineer II Homebase · Permanent Full-time Aug 2024 - Present · 4 mos Toronto, Ontario, Canada · Hybrid --- Full Stack Software Engineer Loxo · Full-time Oct 2021 - Jun 2024 · 2 yrs 9 mos Remote - Designed, implemented, and maintained full-stack projects. - Led end-to-end development of a new Chrome extension, achieving significant user adoption. - Assisted in debugging authentication flows and developing a React Native iOS app. - Improved integrations with Stripe, Twilio, Nylas, and ChurnZero. - Optimized page load speeds by 300% using asynchronous viewport rendering. - Worked with data, design, marketing, and customer success teams. - Assisted customer success teams in resolving live debugging and client issues. - Managed weekly code deployments, monitored with Rollbar and Grafana, and optimized GitHub Actions CI/CD pipelines. --- Full Stack Software Developer LICKROOM Inc · Permanent Full-time Aug 2020 - Oct 2021 · 1 yr 3 mos London, Ontario, Canada - Utilized MobX-State-Tree for state management and generated GraphQL TypeScript typings. - Automated deployment of serverless AWS Lambda functions and RDS infrastructure using Terraform and Pulumi. - Migrated a dynamic landing page to AWS EC2 using Route 53 and Caddy. - Rebuilt customer-facing websites with React, Next.js, and Strapi on AWS Fargate with a blue-green deployment. --- Intern Software Developer Vocalmast · Internship Apr 2018 - Sep 2018 · 6 mos Toronto, Canada Area - Collaborated on designing a CMS platform tailored to client needs. - Implemented REST APIs in JavaScript for backend MySQL integration. - Provided extensive training for a replacement to ensure continuity. - Integrated APIs for payment gateways like Stripe and PayPal using PHP and jQuery.",
            "Skills": "Ruby on Rails, Ruby, Full-Stack Development, Software Deployment, GraphQL, AWS Lambda, Terraform, React, Next.js.",
            "Projects": "Designed, implemented, and maintained full-stack projects. Led end-to-end development of a new Chrome extension, achieving significant user adoption. Assisted in debugging authentication flows and developing a React Native iOS app. Improved integrations with Stripe, Twilio, Nylas, and ChurnZero. Optimized page load speeds by 300% using asynchronous viewport rendering. Worked with data, design, marketing, and customer success teams. Assisted customer success teams in resolving live debugging and client issues. Managed weekly code deployments, monitored with Rollbar and Grafana, and optimized GitHub Actions CI/CD pipelines. Utilized MobX-State-Tree for state management and generated GraphQL TypeScript typings. Automated deployment of serverless AWS Lambda functions and RDS infrastructure using Terraform and Pulumi. Migrated a dynamic landing page to AWS EC2 using Route 53 and Caddy. Rebuilt customer-facing websites with React, Next.js, and Strapi on AWS Fargate with a blue-green deployment. Collaborated on designing a CMS platform tailored to client needs. Implemented REST APIs in JavaScript for backend MySQL integration. Provided extensive training for a replacement to ensure continuity. Integrated APIs for payment gateways like Stripe and PayPal using PHP and jQuery."
        },
        "job_description": {
            "Role": "As a Homie, you'll be part of an unstoppable team that puts customers first, embraces each day with excitement, and strives for excellence in everything you do. We’re revolutionizing the way small businesses manage their teams and grow their business. What this means for you is a shared passion for innovation and making a difference for the people we serve. So what do you say, will you join us on our mission to empower small businesses?",
            "Qualification": "4+ years of Mobile Software Engineering experience. Expert in Kotlin, Kotlin coroutines, and various common Android frameworks. Nice to have: Experience with Java and Jet pack components MVI & compose. Advanced understanding of object-oriented software design and design patterns, and how they apply to the frameworks listed above. Advanced understanding of performant code. Knowledge of Android UI design principles, patterns, and best practices. Experience with RESTful APIs and third-party libraries. Testing framework experience - unit, feature, and integration. Knowledge of Jira, Git, Github, CircleCI, and development using pull requests. Strong systematic and problem-solving skills. Ability to work from the office weekly on Tuesdays and Wednesdays."
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "New York Institute of Technology - Vancouver Master of Science - MS, Cybersecurity May 2021 - Dec 2022 - Grade: A Ahmedabad University Bachelor's Degree, Information and Communication Technology 2014 - 2018",
            "Experience": "Software Development Engineer Amazon Web Services (AWS) · Permanent Full-time Mar 2023 - Present · 1 yr 9 mos Mobile Application Developer Apping Technology · Full-time Jul 2021 - Jun 2022 · 1 yr - Created mobile apps for various clients using Flutter. Mobile Application Developer DcodeAI · Full-time Aug 2020 - Jul 2021 · 1 yr - Developed the DcodeAI suite consisting of: DcodeAI Student App DcodeAI Teacher App Python IDE with data science and machine learning packages such as NumPy, SciPy, Matplotlib, NLTK, Pillow, Scikit-Learn, and Pandas. Full Stack Engineer Cheruvu · Full-time Aug 2018 - Aug 2020 · 2 yrs 1 mo - Responsible for creating Android apps and developing backend APIs using the Spring MVC Framework. - Gained knowledge of AWS for deploying servers. Machine Learning Intern Disha Consultants - The Education Experts · Internship Aug 2017 - Aug 2018 · 1 yr 1 mo - Developed a Foreign University Recommendation System using Python libraries such as NumPy, Pandas, scikit-learn, and pickle. - Implemented the K-Nearest Neighbors (KNN) algorithm. - Enabled students to input profiles including IELTS/TOEFL scores, GRE scores, CGPA, and other academic credentials. - Predicted universities where students had higher chances of admission based on these features.",
            "Skills": "AWS CDK, TypeScript, Ruby , Flutter, Java",
            "Projects": "Silencio Android App Jan 2017 - Apr 2017 Associated with Ahmedabad University - Designed an app to help students automatically silence their smartphones during class. - Users enter their schedule, and the app silences the phone during classes and reverts to normal mode afterward. Smart Helmet Jan 2017 - Apr 2017 Associated with Ahmedabad University - Created a helmet as a data source to capture daily data on pollution, traffic, and other metrics. - Sent collected data to the government to help monitor real-time city conditions and plan actions to reduce pollution and traffic. Rubik's Cube Solver Jan 2017 - Mar 2017 Associated with Ahmedabad University - Developed an Android app to solve Rubik's cubes using the min2phase algorithm. - Utilized HSV color space for automatic color detection. USB Device Driver Feb 2016 - Apr 2016 Associated with Ahmedabad University - Built a USB Character Device Driver to enable users to read and write characters to USB devices. P2P File Sharing Project Jan 2016 - Mar 2016 Associated with Ahmedabad University - Created a software system using socket programming in Java to share files between computers on the same network. Search Engine Feb 2015 - May 2015 Associated with Ahmedabad University - Developed a basic search engine in Java to search for files across a computer. - Included an indexing system for pre-search optimization. Home Automation for Mute People Associated with Ahmedabad University - Empowered mute individuals to control home appliances using hand gestures. - Used OpenCV for gesture detection and Raspberry Pi as the controller."
        },
        "job_description": {
            "Role": "This role will involve designing and developing software products that impact many areas of our business. The individual in this role will have responsibility help define requirements, create software designs, implement code to these specifications, provide thorough unit and integration testing, and support products while deployed and used by our stakeholders.",
            "Qualification": "Basic Qualifications 3+ years of non-internship professional software development experience 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience Experience programming with at least one software programming language Preferred Qualifications 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience Bachelor's degree in computer science or equivalent"
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "Bachelor’s degree/University degree or equivalent experience This job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required. Education: **University of Toronto - University of Trinity College**   Honours BSc, Computer Science and Mathematics - **GPA:** 3.9/4.0 - **Achievements:** Dean's List, Chancellor's Scholarship - Trinity College",
            "Experience": "**Software Developer** **Citi** **2023 - Present** · 1 yr 11 mos   Mississauga, Ontario, Canada · Hybrid --- **Senior Consultant** **KPMG Canada** **2017 - 2021** · 4 yrs 333 Bay Street, Toronto, Ontario --- **Fund Administration Associate** **Investment Administration Solutions** **2016 - 2016** · Less than a year 330 Bay Street, Suite 400, Toronto, ON, M5H 2S8",
            "Skills": "Accounting, Financial Statement Analysis, QuickBooks, Accounts Payable & Receivable, International Tax, Finance, TensorFlow, Python (Programming Language)",
            "Projects": ""
        },
        "job_description": {
            "Role": "Conduct tasks related to feasibility studies, time and cost estimates, IT planning, risk technology, applications development, model development, and establish and implement new or revised applications systems and programs to meet specific business needs or user areas Monitor and control all phases of development process and analysis, design, construction, testing, and implementation as well as provide user and operational support on applications to business users Utilize in-depth specialty knowledge of applications development to analyze complex problems/issues, provide evaluation of business process, system process, and industry standards, and make evaluative judgement Recommend and develop security measures in post implementation analysis of business usage to ensure successful system design and functionality Consult with users/clients and other technology groups on issues, recommend advanced programming solutions, and install and assist customer exposure systems Ensure essential procedures are followed and help define operating standards and processes Serve as advisor or coach to new or lower level analysts Has the ability to operate with a limited level of direct supervision. Can exercise independence of judgement and autonomy. Acts as SME to senior stakeholders and /or other team members. Appropriately assess risk when business decisions are made, demonstrating particular consideration for the firm's reputation and safeguarding Citigroup, its clients and assets, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues with transparency.",
            "Qualification": "5-8 years of relevant experience Experience in systems analysis and programming of software applications Experience in managing and implementing successful projects Working knowledge of consulting/project management techniques/methods Ability to work under pressure and manage deadlines or unexpected changes in expectations or requirements"
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "The Ohio State University Bachelor's Degree, Computer Science Engineering 2013 - 2017 - Activities and Societies: - ACM Programming Contest - OSU ACM School Team Member (October 2015 - 2017) - Won the silver medal (2nd) in algorithm programming during the OSU ACM qualifying contest final round. - Represented OSU at the ACM East Center America Regional Programming Contest. - Specialization: Information and Computation Assurance (CIA) - Skills: Computer Science, Optimization, and more. The Second High School Attached to Beijing Normal University High School 2010 - 2013",
            "Experience": "Amazon Full-time · 5 yrs 5 mos On-site Software Dev Engineer II Jul 2021 - Present · 3 yrs 5 mos Toronto, Ontario, Canada Software Dev Engineer I Mar 2021 - Jul 2021 · 5 mos Toronto, Ontario, Canada Software Dev Engineer I Jul 2019 - Mar 2021 · 1 yr 9 mos New York, New York, United States",
            "Projects": "Amazon AWS: System Error Log Visualization and Analysis System Aug 2017 - Jan 2018 Associated with an academic project. - Developed a full-stack system to obtain, filter, and visualize error logs with predictive capabilities. - Implemented Amazon Lex skills to analyze multiple words in one sentence. - Expanded the Amazon Alexa Skills App using Amazon Lambda for enhanced access to Amazon Lex skills. - Configured RapidMiner Server on AWS for training and predictive modeling of error data stored in DynamoDB. - Pushed notifications to Amazon Echo device users via Amazon SNS. - Integrated third-party platforms like Facebook and Slack, achieving 98% customer satisfaction from 50+ users. - Skills: Computer Science Android Application: 'Bump2Share' Oct 2017 - Jan 2018 Associated with an academic project. - Designed an Android video player that combines several phone screens into one larger screen for video playback. - Built a Web video player for online videos and enhanced local offline video player functionality using Android Studio. - Implemented accelerometer-based screen ordering using Android Studio. - Integrated Firebase authentication to resolve single-user multi-account issues. - Utilized Firebase Realtime Database to store hardware information, location data, and video details. - Skills: Computer Science Network Security Project Oct 2017 - Jan 2018 Associated with an academic project. - Conducted network security analysis and scanning for a campus network. - Scanned 17 targets using tools like Nmap to discover systems and Nessus to identify vulnerabilities. - Used Metasploit to exploit vulnerabilities and Tcpdump/Wireshark to analyze network traffic.",
            "Skills": "Python, Cascading Style Sheets (CSS), AWS CloudFormation"
        },
        "job_description": {
            "Role": "Experience (non-internship) in professional software development Experience designing or architecting (design patterns, reliability and scaling) of new and existing systems 3+ years of professional software development experience 2+ years of design or architecture (design patterns, reliability and scaling) of new and existing systems experience Experience with full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations",
            "Qualification": "Basic Qualifications 3+ years of non-internship professional software development experience 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience Experience programming with at least one software programming language Preferred Qualifications 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience Master's degree in computer science or equivalent"
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "University of Toronto Scarborough: Bachelor of Science in Computer Software Engineering (September 2020 - August 2024).",
            "Experience": "Software Engineer I at BitGo (September 2024 - Present): Works on back-end development and systems design in Toronto. Software Engineer - Amplify at RBC (May 2023 - August 2023): Developed a web solution using React and Node to assist newcomers in finding rental homes. Designed and deployed a distributed system with microservices architecture, containerized using Docker, and deployed with OpenShift Kubernetes. Presented the project to RBC executives, including the CTO and CEO of RBC Insurance. Software Engineer at Sayyara (September 2022 - December 2022): Built a full-stack web application using Spring ecosystem, designed relational databases, and implemented CI/CD pipelines with GitHub Actions, reducing bugs by 20%. Software Engineer at RBC (January 2022 - August 2022): Created a CLI tool to connect defect management systems via APIs, implemented web scraping to improve automation, and participated in hackathons and coding camps. Freelance Web Developer (June 2021 - September 2021): Collaborated to build websites for small businesses, improving site traffic by up to 30% through enhanced user experience. Swim Instructor at Lucky Swimmer (March 2018 - January 2022): Instructed swimming and contributed to participant safety and skill development.",
            "Skills": "Proficient in Go, Java, Python, Spring, React, Node.js, and systems design. Experienced in full-stack web development, microservices architecture, and CI/CD pipelines.",
            "Projects": "Developed a web solution using React and Node to assist newcomers in finding rental homes. Designed and deployed a distributed system with microservices architecture, containerized using Docker, and deployed with OpenShift Kubernetes. Presented the project to RBC executives, including the CTO and CEO of RBC Insurance. Built a full-stack web application using Spring ecosystem, designed relational databases, and implemented CI/CD pipelines with GitHub Actions, reducing bugs by 20%. Created a CLI tool to connect defect management systems via APIs, implemented web scraping to improve automation. Collaborated to build websites for small businesses, improving site traffic by up to 30% through enhanced user experience."
        },
        "job_description": {
            "Role": "Design and build scalable, well abstracted, and robust APIs, libraries, and services to empower our API-first platform • Own functionality and scalability features by taking responsibility from inception to deployment and customer integration • Expose and document functionality to the UI, third-party developers, and our internal and external tooling • Collaborate with cross-functional teams to define, design, and ship new features • Write clean, maintainable, and efficient code • Ensure the performance, quality, and responsiveness of applications • Identify and correct bottlenecks and fix bugs • Continuously discover, evaluate, and implement new technologies to maximize development efficiency • Participate in code reviews and contribute to a culture of continuous improvement • Work closely with product managers, designers, and other engineers to understand and refine product requirements • Provide mentorship to your peers in the broader engineering team through code reviews and education on best practices",
            "Qualification": "3+ years of proven experience of back-end and server-side development • Great at algorithm design, problem solving, and complexity analysis • Strong experience with of TypeScript, Node.js and Express • Strong experience with Node.js, TypeScript, PostgreSQL and MongoDB • Strong experience with RESTful API design • Experience with microservices and service-oriented architectures • Experience with unit and functional testing and debugging • Experience in Git/GitHub and branching methodologies, code review tools, CI tools, etc. • Ability to move quickly and adjust course as needed in a fast-paced environment • Bachelor’s degree in computer science, applied mathematics, or another technical discipline from a top university • Understanding of and strong interest in cryptocurrencies and blockchain • Experience developing consumer-facing crypto products • Proven experience building public-facing APIs in a production environment • Ability to work full-stack and familiarity with React  • Experience working with clients and/or business partners • Familiarity with any of the following: digital wallets, clearing and settlement, lending, trading, accounting systems, etc"
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "Queen's University: Bachelor of Computing (Honours) Specialization in Software Design (2015 - 2019). Harbord Collegiate Institute: Ontario Secondary School Diploma (2011 - 2015).",
            "Experience": "Software Developer II at Moneris (October 2023 - Present): Works on software development projects in Toronto. Software Developer at Moneris (September 2022 - October 2023): Contributed to technical and professional development through the Start @ Moneris program. Career Launch Associate at RBC (March 2020 - March 2021): Rotated through roles in Public & Corporate Banking Operations, Advisor Digitization & Technology Enablement, and fundraising with Right To Play. Gained experience in AI chatbot documentation, communication, and agile learning. Intern, CNO at Right To Play (September 2020 - November 2020): Assisted in donor research, sponsorship proposals, and grant applications for high-net-worth portfolios. Bartender at Canada's Wonderland (July 2018 - December 2019): Provided high-quality service in a fast-paced environment. IT Director at Queen's Venture Capital (October 2017 - April 2018): Developed a responsive website with client-specified features like email newsletters and contact forms using HTML, CSS, JavaScript, PHP, and MySQL.",
            "Skills": "Proficient in Laminas, HTML, Bootstrap, Unity, and MySQL. Experienced in game development, web development, and systems design. Language proficiencies include English (Native or Bilingual) and Cantonese (Professional Working). Certifications include Standard First Aid with CPR-C and Smart Serve.",
            "Projects": "Qlicker (September 2018 - April 2019): Developed a mobile-capable web application to facilitate student participation in classes. The application serves as an alternative to hardware-based systems like iClicker, enabling students to use their own devices for classroom interaction. Battle Rhythm: Game Developed in Unity (January 2016 - April 2017): Designed a rhythm-based game inspired by classic Space Invaders. Players hit notes corresponding to a song while shooting at enemies. The project emphasized novel game mechanics and applied good game design practices learned during the course."
        },
        "job_description": {
            "Role": "• Analyze requirements, design, update and repair solutions that pertain to improving the product through development, or business intelligence. • Analyze business requirements for complex issues to determine the best solution; some user interaction may be required. • Conduct data analysis to support business requirements, can transfer design concepts across environments. • Participate in the architecture, design and implementation of complex software including having demonstrated knowledge of software development best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations. • Builds solutions that operate key platforms that power our business and communicates effectively progress/approach with technical and non-technical details. • Works directly with the users of your software, to deeply understand the domain and identify opportunities for optimizations • Conceives of new features or re-architecting areas for user and performance improvement.",
            "Qualification": "• Bachelor's degree required in Software Engineering, Computer Science; or equivalent work experience in a Technology or business environment • Minimum 4 years of experience working in software development, or business intelligence environments • Proficient in software development (RPG/AS400) across multiple project steps; and contribute to the architecture and design of new and current systems • Develop and support moderately different type of programs in applications using ILE RPG using IBM iSeries Systems, and DB2 database, with strong SQL skills • Experience with other programming languages Java and ability to use and contribute to code in GitLab with API development • Comfortable in an Agile/Scrum/DevOps environment. • Proficiency in payment systems and the merchant acquiring business • Knowledge in Logistics, inventory management and scheduling systems"
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "Indian Institute of Technology, Kharagpur: Bachelor of Technology in Computer Science and Engineering (July 2015 - May 2019). DAV Public School BSEB, Patna: High School (2013 - 2015). Don Bosco Academy, Patna: Secondary School (2007 - 2013).",
            "Experience": "Senior Software Engineer at Intuit (August 2024 - Present): Leads development initiatives in backend technologies and cloud infrastructure. Software Developer 2 at Intuit (February 2023 - August 2024): Migrated legacy tech stacks to Spring Boot, containerized applications, and designed a stateful database re-encryption capability. Developed tech strategy for frontend UI modernization. Software Engineer 2 at Intuit (February 2021 - January 2023): Implemented a Kafka-based data manager service for CCPA compliance, built performance testing pipelines, and developed a data deletion tool to manage compliance. Software Engineer 1 at Intuit (July 2019 - January 2021): Created tools for debugging, monitoring, and PL/SQL procedure automation, improving system reliability and performance. Software Intern at Intuit India (May 2018 - July 2018): Developed a Completeness Decision Table Generator for Turbotax Desktop Canada using Python and XML.",
            "Skills": "Proficient in Java, Spring Boot, React, Kubernetes, Docker, PL/SQL, and Kafka. Experienced in backend systems design, cloud infrastructure, machine learning, and application development. Language proficiencies include English (Professional Working) and Hindi (Native or Bilingual).",
            "Projects": "Machine Learning Course Project (March 2018 - Present): Developed a spam classifier application using Python, implementing a 3-layer neural network model built from scratch. Microsoft Code Fundo (March 2018 - Present): Participated in the Microsoft Code Fundo Hackathon, where the team developed a shopping application with both web and Android versions."
        },
        "job_description": {
            "Role": "• Contribute to the design and development of scalable, highly-available production systems and applications • Roughly 80-90% hands-on technical work, delivering high-quality code, resolving bugs/defects, and delivering optimizations • Follow and contribute to the high engineering and operational standards within the team • Guide and help junior engineers with technical problems • Partner effectively within their scrum team to identify pain points, brainstorm, and deliver solutions to customers",
            "Qualification": "• 2+ years of experience developing front-end, back-end, or mobile applications •  Relevant experience in one or more of the following tech stacks: Java/Spring, ReactJS, Kotlin/Swift or equivalent • Solid grasp software engineering fundamentals (data structures & algorithms) and their practical application  • Experience working on scalable production systems and applications, including the development and integration with web services (REST, GraphQL, or RPC)  • Familiarity with all aspects of a software development life cycle (design, development, operations, etc) • Previous experience working with Artificial Intelligence (GenAI or otherwise) is a bonus"
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "Ivano-Frankivsk National Technical University of Oil and Gas: Master’s Degree in Information Technology (September 2022 - January 2024). Kyiv College of Telecommunication: Bachelor’s Degree in Information Technology (June 2020 - July 2022). Kyiv College of Telecommunication: High School Diploma in Information Technology (2018 - 2020).",
            "Experience": "Software Developer Engineer in Test | DevOps at Insight Global (July 2024 - Present): Develops testing frameworks using Python and Playwright, creates test cases, and configures CI/CD pipelines with AWS and Terraform. Test Automation Engineer at Upwork (January 2024 - June 2024): Designed and implemented API and WebUI testing frameworks and conducted exploratory testing using Python, Playwright, and Terraform. Senior Test Automation Engineer at EPAM Systems (December 2021 - January 2024): Created BDD testing frameworks for event-driven architectures, achieving 75% test coverage. Set up CI/CD pipelines, integrated test automation with XRay, and developed Terraform modules for AWS and GCP. QA Automation Engineer at GlobalLogic (March 2019 - March 2020): Developed BDD frameworks for AWS-based applications and conducted end-to-end testing. Mobile Automation QA Engineer at Synergetica (March 2017 - March 2019): Designed mobile and WebUI automation frameworks using Appium and Selenium. QA Automation Engineer at Glorium Technologies (August 2016 - February 2017): Developed automated test suites for WebUI and REST APIs, achieving 75% test coverage.",
            "Skills": "Proficient in Python, Java, C#, Groovy, and automation frameworks like Selenium, TestNG, and Cucumber. Experienced with Kafka, RabbitMQ, Docker, Kubernetes, and cloud platforms such as AWS and GCP. Language proficiency includes English (Full Professional).",
            "Projects": ""
        },
        "job_description": {
            "Role": "Automated test development - design, develop, and maintain test cases to validate MATLAB software functionality * Code review and inspection - participate in code reviews and inspections to ensure the testability of code and its adherence to coding standards * Test case development - build and enhance automated test cases in MATLAB that facilitate testing across different application layers * Quality assurance - contribute to maintaining high-quality software by ensuring comprehensive test coverage and enforcing testing best practices Documentation - create and maintain documentation related to automated test cases, test plans, and test results to support knowledge sharing and transparency",
            "Qualification": "3-6+ years as a Software Developer in Test * Bachelor's or Master's degree in computer science, Software Engineering, or a related field * Experience with the Matlab language and programming platform * Little Matlab and Python ca be accepted * Experience in Python and/or Java programming language considered an asset * Experience working with multiple test automation tools and frameworks such as Selenium Web Driver, Katalon, Watir, Cucumber (Examples) and others considered an asset * Experience with GitLab for version control and CI/CD processes and Git Runners for test automation * Solid understanding of Linux environments and command-line tools * Experience with Linux clusters and cluster job managers is considered an asset - Slurm Experience with agile development Nice to Have Skills & Experience Plusses * Strong analytical and problem-solving skills, ability to identify and troubleshoot issues efficiently * Highly collaborative team player who can quickly earn the confidence of co-workers and teammates. * Excellent oral and written communication skills * Fluent in English, written and oral. French is an asset."
        }
    },
    {
        "job_title": "SDE",
        "resume": {
            "Education": "Centennial College: Advanced Diploma in Software Engineering (2018 - 2021). Instituto Tecnológico de Santo Domingo: Studies in Computer Software Engineering (2017).",
            "Experience": "Software Engineer at Electronic Arts (EA) (November 2022 - Present): Works in Toronto on software engineering projects. Lead Mobile App Engineer at XSENSOR Technology Corporation (November 2021 - April 2024): Led the development of mobile applications and managed engineering tasks in Calgary. Co-Founder & Software Engineer at MyBee Technologies Inc (May 2019 - November 2021): Developed the MyBee.app web/mobile app using React/React-Native, Docker, and Stripe SDK. Built APIs using NestJS and Swagger, optimized microservices with gRPC, WebSocket, and Redis, and maintained a MongoDB database. Software Developer at Ontario Ministry of Children, Community and Social Services (June 2019 - June 2020): Created internal tools using Python, Flask, and NodeJS to enhance test automation. Refactored a SpringBoot application for code coverage analysis with Elastic Stack and implemented RESTful APIs. Software Developer at Banco de Reservas (July 2016 - October 2016): Streamlined course planning and development processes using Moodle tools. Software Developer at Decorarte Deyanira (February 2015 - July 2016): Contributed to software development projects in Santo Domingo.",
            "Skills": "Proficient in React, React Native, NestJS, Python, Flask, Docker, and MongoDB. Experienced in developing RESTful APIs, gRPC, microservices, and optimizing CI/CD pipelines. Language proficiencies include English (Native or Bilingual) and Spanish (Native or Bilingual).",
            "Projects": "Developed the MyBee.app web/mobile app using React/React-Native, Docker, and Stripe SDK. Built APIs using NestJS and Swagger, optimized microservices with gRPC, WebSocket, and Redis, and maintained a MongoDB database."
        },
        "job_description": {
            "Role": "• You will work with Dev and QA partners to identify areas of improvement through new tools and automation strategies. • You will help us deploy internal software tools. • You will build, test, and deploy solutions that support automation deliverables. • Support an increased adoption of automation and tools within game teams. Aid in the identification and requirements gathering for new tools. • Perform risk analysis of new features – identify impact and scope. • Help prioritize bug fixing efforts and identifying areas of test focus.",
            "Qualification": "• 5+ years of professional experience with a focus on concepts and language varieties. Experience with Java, and Spring Framework is a must • Proficiency in Test-driven Development techniques (TDD) and unit test frameworks(jUnit) • Familiarity with CI/CD pipeline (Jenkins) • Familiarity with Game Dev and C+ • Bachelor's degree in computer science, Computer Engineering, Software Engineering or equivalent • Experience with the software development life cycle, software engineering methodologies and practices, and their application to both development and QA."
        }
    }
]