[
    {
        "job_title": "MLE",
        "resume": {
            "Education": "University of Toronto Master of Science - MS, Applied Computing (Data Science) (2020 - 2022) SRM University Bachelor of Technology - BTech, Computer Science and Engineering (2016 - 2020)",
            "Experience": "Guidepoint AI Engineer, June 2024 - Present (6 months), Toronto, Ontario, Canada SAP 2 years 6 months Senior Machine Learning Engineer, March 2024 - June 2024 (4 months), Toronto, Ontario, Canada Responsible for strategic leadership and collaborative decision-making in guiding machine learning product development and shaping team processes with a focus on operational efficiency and mentorship, alongside cross-functional efforts with data science, architecture, business, and sales. Specialist Machine Learning Engineer III, April 2023 - March 2024 (1 year), Toronto, Ontario, Canada Initiated and led e-commerce machine learning product development from concept to deployment. Championed engineering best practices and led automation initiatives for testing and deployment of ML services. Provided mentorship and facilitated partnerships with other big technology companies including Microsoft and Databricks to optimize data processes. Specialist Machine Learning Engineer II, January 2022 - March 2023 (1 year 3 months), Toronto, Ontario, Canada Led the development and deployment of a replenishment recommendation feature, enhancing sales performance across numerous enterprises. Engineered a real-time intrusion detection service to evaluate the threats for billions of login and registration requests every month for our enterprise customers. Promoted test-driven development best practices. Recognized for exceptional contributions in innovation and demo presentations within a large group of engineering professionals. ICICI Bank Canada Data Science Consultant, May 2021 - December 2021 (8 months), Toronto, Ontario, Canada Implemented an Azure ETL pipeline for evaluating telephonic sales pitches at ICICI Bank, reducing transcription times by 75%, and fine-tuned a transformer-based model, decreasing poor customer reviews by a third. Persistent Systems Data Science Intern, December 2019 - March 2020 (4 months), Pune, Maharashtra Developed a full-stack Essay Grading System leveraging NLP for feature extraction and neural networks, complete with a user interface for essay submission and grading. Reliance Industries Limited Data Science Intern, December 2018 - January 2019 (2 months), Navi Mumbai, India Analyzed Reliance’s logistics data to identify KPIs, managed project lifecycle from data wrangling to visualization, and developed live dashboards for real-time fleet monitoring, saving time and costs.",
            "Skills": "Continuous Integration and Continuous Delivery (CI/CD), Data Engineering, MLOps, Machine Learning, Data Science, Long Short-Term Memory (LSTM), Natural Language Processing (NLP), BERT",
            "Projects": "Effects of COVID-19 Induced Lockdown on Mobility Pattern and Subsequently, on Case Counts Sep 2020 - Jan 2021 Associated with: University of Toronto This project was submitted for Canadian Statistical Science Institute's Biostatistics COVID-19 Case Study competition. The goal of this project was to investigate the relationship between Google's mobility data and the number of new cases of COVID-19. Having understood the link between mobility and the increase in COVID-19 cases, policymakers can leverage this information when deciding on the most important plan of action (e.g., closing schools may have a greater impact than closing pharmacies). We determined both the direction (positive/negative) and strength of the relationships between mobility data and new cases. Recommender System - Predicting User Ratings on Amazon Nov 2020 - Dec 2020 Associated with: University of Toronto Tuned the pre-trained BERT model from Huggingface to perform linear regression for predicting user ratings on Amazon. Achieved a top position in the in-class Kaggle competition for CSC2515."
        },
        "job_description": {
            "Role": "You will be part of the central SAP AI Development Unit and support our customers with  the adoption of SAP Business AI solutions, helping them to improve their business results based on latest machine learning technology. In this role you work closely with our development teams and the customer to achieve high value propositions and apply machine learning technology in the daily work of our customers.  As a (Senior) Development Project Consultant you guide and steer customer and internal teams  to achieve state of the art machine learning solutions.This position requires the ability to work and communicate in a dynamic, interdisciplinary, and intercultural team in an agile and efficient way.  As a thought leader in Machine Learning you appreciate the possibility for learning and personal development and therefore you keep track of the latest developments and share your knowledge actively with others. You will be working with and leading teams to successful projects in the context of Machine Learning Technology.",
            "Qualification": "Degree in Mathematics, Physics, Computer Science, Data Science Several years relevant work experience in sales or technical oriented customer projects Experienced in guiding customer interactions up to C Level Good Overview of Machine Learning Trends and Technolgy Experience in implementation of Machine Learning solutions and platforms Knowledge and experience in Machine Learning Programming Frameworks, like TensorFlow or scikit Programming Skills, like ABAP, Java, Python, JavaScript, NodeJS, Jupyter Notebook, ABAP Database Knowledge Web and Cloud Computing Knowledge Ideally SAP technology and SAP system integration technology Fluency in English AND German (written and spoken language)"
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Education: Master of Data Science in Artificial Intelligence, University of British Columbia, Canada (2021-2023). Bachelor of Engineering in Software Engineering, National University of Singapore, Singapore (2017-2021).",
            "Skills": "Skills: Python, TensorFlow, Keras, Scikit-learn, Reinforcement Learning, Computer Vision, SQL, R, and Docker.",
            "Experience": "Experience: Position: Machine Learning Engineer Intern Organization: Google Duration: April 2022 - Present (2 years, 7 months) Key Achievements: Developed machine learning models to enhance Google Search functionality, improving query understanding accuracy by 20%. Collaborated with a diverse team to implement deep learning techniques in natural language processing for better context-aware results. Assisted in the deployment of scalable models using Docker and Kubernetes, ensuring robustness and efficiency in production environments. Position: Data Analyst Intern Organization: Grab Duration: January 2021 - December 2021 (12 months) Key Achievements: Analyzed large datasets to identify user behavior trends and optimize the ride-hailing service operations, contributing to a 15% increase in user satisfaction. Developed predictive models using Python to forecast user demand and adjust service availability in real-time. Created interactive dashboards to present findings to stakeholders, facilitating data-driven decision-making. Position: Research Intern Organization: UBC AI Research Lab Duration: September 2020 - May 2021 (8 months) Key Achievements: Conducted research on algorithms for improving image recognition systems, resulting in a publication in a reputable machine learning conference. Developed and tested various deep learning architectures, contributing to a project focused on medical image analysis. Engaged in collaboration with academic peers to refine methodologies and enhance project outcomes.",
            "Projects": "Projects: Developed machine learning models to enhance Google Search functionality. Analyzed large datasets to optimize the ride-hailing service operations, contributing to a 15% increase in user satisfaction. Conducted research on algorithms for improving image recognition systems, resulting in a publication in a reputable machine learning conference."
        },
        "job_description": {
            "Role": "The Student Researcher Program fosters academic collaborations by hiring students onto research projects aligned to company priorities in scientific advancement. The program offers placements on teams across Google, for research, engineering, and science roles. As a Student Researcher, you will have the opportunity to participate in research projects focused on developing solutions for real-world, large-scale problems.",
            "Qualification": "Minimum qualifications: Bachelor's or Master’s degree in Computer Science, Linguistics, Statistics, Biostatistics, Applied Mathematics, Operations Research, Economics, Natural Sciences, or related technical field. Experience in one area of computer science (e.g., Natural Language Understanding, Human Computer Interactions, Computer Vision, Machine Learning, Deep Learning, Algorithmic Foundations of Optimization, Quantum Information Science, Data Science, Software Engineering, or similar areas). Preferred qualifications: Experience as a researcher, including internships, full-time, or at a lab. Experience contributing research communities or efforts, including publishing papers in major conferences or journals. Experience with one or more general purpose programming languages (e.g., Python, Java, JavaScript, C/C++, etc.)."
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Master of Science in Applied Computing, University of Toronto, Canada (2020-2023). Bachelor of Technology in Computer Science, Indian Institute of Technology (IIT), Delhi, India (2016-2020).",
            "Skills": "Python, R, TensorFlow, PyTorch, Scikit-learn, SQL, Deep Learning, Matplotlib, Seaborn, Amazon Web Services, and Google Cloud",
            "Experience": "Company: IBM Duration: January 2022 - December 2023 (12 months) Highlights: Developed machine learning models for anomaly detection in network security, improving threat detection accuracy by 25%. Collaborated with multidisciplinary teams to refine data pre-processing and feature engineering techniques, enhancing model performance. Utilized cloud platforms like AWS to deploy machine learning solutions, ensuring scalability and reliability in production environments. Data Scientist Intern Company: Swiggy Duration: June 2019 - June 2020 (12 months) Highlights: Conducted analyses to optimize food delivery logistics, resulting in a 15% reduction in delivery times and increased customer satisfaction. Implemented recommendation algorithms that improved user engagement by analyzing customer preferences and order history. Participated in A/B testing to evaluate new features and provide data-driven insights for product enhancements. Research Assistant University: University of Toronto Duration: January 2020 - June 2020 (6 months) Highlights: Assisted in research focused on the application of deep learning in healthcare, contributing to the development of predictive models for patient outcomes. Conducted literature reviews and implemented state-of-the-art algorithms, resulting in improved data interpretability and analysis in ongoing projects.",
            "Projects": "Co-authored research papers presented at international conferences, showcasing advancements in machine learning applications."
        },
        "job_description": {
            "Role": "Building Credibility and Trust: Through consultative methods at all levels, both internally and externally, to facilitate the closure of highly complex deals. Developing Proposals: Build propositions for clients to grow their businesses by solving strategic and tactical business problems with IBM’s proven technology solutions. Delivering Proof of Concepts: Deliver proof of concepts and simplify complex technical subjects for client education. Defining and Detailing IBM Solutions: Design feasible IBM solutions that complement and enhance clients' existing tech stacks. Sales Prospecting: Apply IBM’s sales methodology to identify new clients and opportunities for expansion with existing clients through multiple channels (email, phone, video creation, social media) - this includes a considerable amount of cold calling. Supporting Teams for Sales Opportunities: Provide support to your team of Business Development and technical colleagues to identify and create up-/cross-sell opportunities within your assigned territory. To be successful in this role, you will need: Confidence to contact and engage potential new customers and deliver an elevated experience. Motivation to achieve sales, business objectives and high client satisfaction, based on the activities you’ll work on Aptitude to learn on utilize selling technologies to network, engage clients, and identify new business opportunities. Embrace curiosity and a growth mindset.",
            "Qualification": "Actively Enrolled: Registered undergraduate or graduate university student. Education: Seeking B.S. or M.S. degree in Computer Science, Data Science, Engineering, Information Systems, or equivalent technical experience. Client Focused: Asks open-ended questions and understands needs to address business challenges. Tech Savvy: Conversant about technology, latest industry trends and how it is being applied to address business challenges. Team Player: Demonstrates team collaboration and can navigate different communication styles. Excellent Communication Skills: Possess verbal, written, and interpersonal skills that are engaging, compelling and influential. Self-Starter: Motivated to work with clients and can lead projects independently."
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Master of Science in Data Science, University of Alberta (2018-2020). Bachelor of Science in Mathematics, University of Waterloo (2014-2018).",
            "Skills": "PyTorch, R, TensorFlow, Keras, Scikit-learn, SQL, Deep Learning, Computer Vision, and Cloud Computing (AWS).",
            "Experience": "Role: Machine Learning Engineer Company: Microsoft Duration: March 2020 - Present (4 years, 8 months) Key Contributions: Developed and deployed machine learning models for predictive analytics, enhancing the accuracy of business forecasts by 30%. Collaborated with cross-functional teams to integrate AI-powered features into the Azure platform, improving customer satisfaction and engagement. Implemented a recommendation system that increased user engagement by 25% through personalized content delivery. Conducted large-scale experiments and A/B testing to evaluate model performance and drive data-driven decision-making. Role: Data Scientist Company: Deloitte Duration: January 2018 - March 2020 (2 years, 3 months) Key Contributions: Built predictive models to assess customer behavior and trends, contributing to strategic business recommendations that improved client retention by 20%. Conducted exploratory data analysis using R and Python to identify key insights from complex datasets, enabling informed decision-making for marketing strategies. Collaborated with clients to implement machine learning solutions that streamlined operations and improved efficiency across various business units. Role: Research Assistant University: University of Alberta Duration: September 2017 - May 2018 (8 months) Key Contributions: Assisted in the development of deep learning models for image classification, contributing to advancements in computer vision research. Conducted literature reviews and feasibility studies to identify cutting-edge techniques that could be applied to ongoing projects. Co-authored research papers published in peer-reviewed conferences, highlighting findings related to machine learning methodologies.",
            "Projects": ""
        },
        "job_description": {
            "Role": "As a Machine Learning Engineer, you will: Work on architecture, design and development of the next generation of Azure AI’s evaluation platform. Work with other researchers, applied scientists, and machine learning engineers in the team to design and build the end-to-end pipelines covering model training, data analysis, model serving and model evaluation. Implement latest evaluation methods from published literature and methods in the industry. Drive new product features and evaluation metrics Embody our culture and values",
            "Qualification": "Required/Minimum Qualifications  Bachelor's Degree in Computer Science, or related technical discipline AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python  o OR equivalent experience. Experience in applying, implementing, and/or developing algorithms for machine learning, artificial intelligence, or statistics. Other Requirements Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:  This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.   Preferred/Additional Qualifications Bachelor's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python  o OR Master's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python   o OR equivalent experience.  Experience with large language models (LLM) architectures, inference, fine-tuning and evaluation. Deep understanding of deep learning model architectures. Experience with building, debugging and optimizing large, high performance ML training jobs. Doctorate in Computer Science, Machine Learning, Statistics  or equivalent technical field a definite plus."
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Master of Science in Computer Science, McGill University (2019-2021). Bachelor of Engineering in Software Engineering, University of Alberta (2015-2019).",
            "Skills": "Pandas, R, NumPy, PyTorch, TensorFlow, Keras, SQL, Machine Learning, Matplotlib, Seaborn, Docker, MLflow, and Apache Spark.",
            "Experience": "Machine Learning Engineer Telus March 2021 - Present (3 years, 8 months) Developed a predictive analytics model that reduced customer churn by 18% through targeted interventions based on user behavior. Implemented deep learning models for customer sentiment analysis from social media data, improving marketing strategies based on real-time insights. Collaborated with cross-functional teams to streamline data processes using Docker for containerization, enhancing the development workflow. Data Scientist RBC (Royal Bank of Canada) January 2020 - March 2021 (1 year, 3 months) Created machine learning algorithms for risk assessment in loan approvals, increasing the accuracy of predictions by 25%. Conducted exploratory data analysis and feature engineering using R and Python to identify key indicators influencing financial decisions. Presented findings to stakeholders through interactive dashboards, facilitating data-driven business strategies. Research Assistant McGill University September 2018 - May 2019 (8 months) Assisted in a research project focused on applying machine learning techniques in healthcare to predict patient outcomes, leading to innovative algorithm development. Developed data preprocessing and analysis scripts to maintain and optimize data quality for research studies.",
            "Projects": "Co-authored a paper on the efficacy of machine learning models in predicting disease progression, presented at a prominent AI conference."
        },
        "job_description": {
            "Role": "We are seeking a highly skilled and experienced Senior Generative AI Developer with deep expertise in Google Cloud Platform (GCP), particularly in Google Gemini and Google's Generative AI tools. As a key contributor, you will be responsible for architecting, developing, and deploying advanced AI/ML solutions using GCP services. You will collaborate with cross-functional teams to design and implement scalable, end-to-end AI models that solve real-world business challenges.  Design, develop, and deploy end-to-end AI/ML models using GCP services Leverage Google Gemini and other Google Generative AI tools (Vertex AI, AutoML, BERT, T5) to build cutting-edge generative AI models Integrate AI solutions into production environments, ensuring scalability, security, and performance Lead projects involving Natural Language Processing (NLP), churn propensity, and large language models Collaborate with data engineers, data scientists, and to optimize model performance and streamline workflows Stay updated with the latest advancements in Google's AI tools and provide strategic insights for their adoption Mentor junior team members and guide them in best practices for AI/ML development",
            "Qualification": "Bachelor's degree in Computer Science, Data Science, Engineering, Artificial Intelligence, or a related field is required. Master's degree or Ph.D. in a relevant field is preferred. Generative AI Expertise: In-depth experience with Google Gemini, BERT, T5, and other Google's state-of-the-art models. Google Cloud Platform: Proficiency in key GCP services, including but not limited to: Vertex AI: End-to-end machine learning lifecycle management. BigQuery ML: Building ML models using SQL in BigQuery. Dataflow & Dataproc: Data processing and pipeline orchestration. Model Deployment: Strong experience in deploying models using GCP services. AI/ML Model Building: Demonstrated ability to build, train, fine-tune, and deploy Churn Predictive and Generative AI models Leadership: Proven experience in leading AI/ML projects and mentoring teams Problem-solving: Strong analytical and critical thinking skills to solve complex AI challenges Communication: Ability to convey complex technical concepts to non-technical stakeholders Collaboration: Experience working in cross-functional teams involving Data Engineers, Software Developers, and Product Managers"
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Master of Science in Applied Computing, University of Toronto (2018-2020). Bachelor of Science in Computer Science, University of British Columbia (2014-2018).",
            "Skills": "Python, R, TensorFlow, Scikit-learn, Deep Learning, SQL, Apache Spark, Model Deployment, and Optimization.",
            "Experience": "Machine Learning Engineer, Shopify (March 2020-Present; 4 years, 8 months): Developed machine learning models to optimize pricing strategies, resulting in a 15% increase in sales conversions. Implemented NLP techniques to enhance customer support chatbots, improving response accuracy and reducing handling time by 30%. Collaborated with data scientists and engineers to create data pipelines using Apache Spark for large-scale data processing and analytics. Data Analyst, Royal Bank of Canada (July 2018-March 2020; 1 year, 9 months): Analyzed customer transaction data to build predictive models for credit risk assessment, improving risk evaluation by 20%. Created visualizations and dashboards using R to communicate insights to stakeholders and enhance strategic decision-making. Conducted A/B testing on product features, providing data-driven recommendations that led to an increase in customer satisfaction. Intern, Canada Post (May 2017-August 2017; 4 months): Assisted in the development of a machine learning model for package delivery routing optimization, resulting in a 10% reduction in delivery times. Utilized data cleaning and preprocessing techniques on historical shipping data to improve model accuracy. Participated in cross-departmental projects aimed at integrating AI solutions to enhance operational efficiency.",
            "Projects": ""
        },
        "job_description": {
            "Role": "Machine Learning Engineers at Shopify use extensive data to build products and create and fine-tune ML models. This has full-blown impact on merchants through first-of-their-kind financial tools, super-charged search and discovery, and novel conversion and ranking systems that connect merchants to buyers. (Phew.) There’s more: insights are shared back into Shopify and put directly into merchants’ hands in the form of highly reusable and interpretable code. This vastly improves the functionality of everything we do- making commerce smarter and more efficient for everyone. Solving complex problems at a serious scale. Dive into massive datasets (petabytes, not terabytes) and build and train models that impact millions of users worldwide. All-in on AI. Utilize GPU optimization, distributed clusters, and the latest ML frameworks to build groundbreaking solutions. Ethical by design. Machine learning can make commerce better — and runs the risk of making it worse, too. Carve out how models and algorithms embed in our product to truly support our mission.",
            "Qualification": "Moving at our pace brings a lot of change, complexity, and ambiguity—and a little bit of chaos. Shopifolk thrive on that and are comfortable being uncomfortable. That means Shopify is not the right place for everyone. Before you apply, consider if you can: Care deeply about what you do and about making commerce better for everyone Excel by seeking professional and personal hypergrowth Keep up with an unrelenting pace (the week, not the quarter) Be resilient and resourceful in face of ambiguity and thrive on (rather than endure) change Bring critical thought and opinion Embrace differences and disagreement to get shit done and move forward Work digital-first for your daily work"
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Bachelor's or Master’s degree in Computer Science, Data Science, Engineering, or a related field.",
            "Experience": "Role: As a Machine Learning Engineer at Bell Canada, you will leverage your expertise in data science and machine learning to develop, implement, and optimize predictive models and advanced analytics solutions. You will work closely with cross-functional teams to harness large datasets and extract actionable insights that drive business outcomes and enhance customer experiences. Key Responsibilities: Design, develop, and deploy machine learning algorithms and models to tackle complex business challenges, including customer segmentation, predictive analytics, and churn reduction. Collaborate with data scientists, software engineers, and product managers to integrate machine learning solutions into production systems and enhance product features. Analyze large datasets to identify trends, patterns, and anomalies that can inform strategies and decision-making processes. Conduct model performance evaluations and implement optimizations to improve accuracy, efficiency, and scalability. Utilize Natural Language Processing (NLP) techniques to analyze customer feedback and enable sentiment analysis for enhanced service delivery. Develop and maintain data pipelines for model training and inference, ensuring data quality and integrity throughout the lifecycle. Present technical findings and insights to both technical and non-technical stakeholders, ensuring alignment and understanding across teams. Proven experience (3+ years) as a Machine Learning Engineer or in a similar position, with a strong portfolio of successful projects.",
            "Skills": "Proficient in Python, along with experience in machine learning frameworks such as TensorFlow, Keras, or Scikit-learn. Strong understanding of machine learning algorithms, data preprocessing, feature engineering, and model evaluation techniques. Experience with data visualization tools (e.g., Tableau, Matplotlib) to communicate insights effectively. Familiarity with cloud platforms (e.g., Azure, AWS) for model deployment and data processing. Excellent problem-solving skills, strong analytical mindset, and the ability to work collaboratively in a team environment. Effective communication skills for conveying technical concepts to diverse audiences.",
            "Projects": "Not specified"
        },
        "job_description": {
            "Role": "Machine Learning Engineer Bell Canada February 2022 - Present    Developed and deployed machine learning models for customer segmentation, increasing marketing campaign effectiveness by 25%. Implemented NLP algorithms to analyze and categorize customer feedback, leading to actionable insights that improved service quality. Collaborated with software engineers to integrate machine learning solutions into existing platforms using Azure, enhancing user experience.  Data Analyst Canada Post January 2021 - December 2022    Analyzed large datasets to build predictive models for operational efficiency, resulting in a 15% cost reduction in logistics. Developed data visualization tools using Tableau, allowing stakeholders to easily interpret complex datasets and drive informed decisions. Conducted A/B testing for new features on the company’s platform, acquiring insights that enhanced user interaction.  Machine Learning Intern BlackBerry May 2020 - August 2020    Assisted in developing computer vision models for security applications, improving intruder detection accuracy by 20%. Worked with the team to preprocess and clean datasets, contributing to better model performance and reliability. Participated in weekly brainstorming sessions to propose innovative AI solutions that align with business objectives.",
            "Qualification": "Education:  Master of Science in Artificial Intelligence, University of Waterloo (2020-2022). Bachelor of Science in Computer Science, Simon Fraser University (2016-2020).   Skills:  Python, TensorFlow, Keras, Scikit-learn, Computer Vision, SQL, Data Visualization (Tableau, Matplotlib), and Cloud Computing (Miscrosoft Azure, Apache Spark)."
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Bachelor of Science in Computer Engineering, University of Michigan (2014-2018). Master of Science in Artificial Intelligence, Georgia Institute of Technology (2018-2020).",
            "Skills": "Python, TensorFlow, Scikit-learn, SQL, Computer Vision, Amazon SageMaker, Docker, Kubernetes, and CUDA.",
            "Experience": "Machine Learning Engineer Spotify (February 2020 - Present) Designed and implemented advanced recommendation systems using collaborative filtering algorithms, increasing user engagement by 40%. Developed real-time NLP models for analyzing song lyrics and user sentiment, enhancing music discovery features. Collaborated with cross-functional teams by employing AWS SageMaker for efficient deployment and scaling of machine learning models. Software Engineer Intern Tesla (June 2019 - August 2019) Assisted in the development of computer vision algorithms for autonomous vehicle safety features, improving detection accuracy of obstacles on the road by 15%. Created a prototype for sensor data fusion that enabled more reliable environmental perception in real-time applications. Contributed to the optimization of machine learning models using Scikit-learn for predictive maintenance, reducing downtime by 20%. Data Scientist Intern IBM (June 2018 - August 2018) Conducted exploratory data analysis to drive insights on customer interactions, improving marketing strategies and increasing conversion rates by 10%. Developed and implemented machine learning models to predict customer preferences based on usage patterns. Automated reporting processes through interactive dashboards, enhancing productivity and decision-making.",
            "Projects": ""
        },
        "job_description": {
            "Role": "As a Machine Learning Engineer in our Content Understanding teams, you will help define and build ML deployed at scale in support of a broad range of use cases driving value in media and catalog understanding. Build production systems that enrich and improve our listeners’ experience on the platform Contribute to designing, building, evaluating, shipping, and refining Spotify’s product by hands-on ML development Prototype new approaches and production-ize solutions at scale for our hundreds of millions of active users Help drive optimization, testing, and tooling to improve quality Perform data analysis to establish baselines and inform product decisions Collaborate with a cross functional agile team spanning design, data science, product management, and engineering to build new technologies and features",
            "Qualification": "You have professional experience in applied machine learning Extensive experience working in a product and data-driven environment (Python, Scala, Java, SQL, or C++, with Python experience required) and cloud platforms (GCP or AWS) You have some hands-on experience implementing or prototyping machine learning systems at scale You have experience architecting data pipelines and are self-sufficient in getting the data you need to build and evaluate models, using tools like Dataflow, Apache Beam, or Spark You care about agile software processes, data-driven development, reliability, and disciplined experimentation You have experience and passion for fostering collaborative teamsExperience with TensorFlow, pyTorch, and/or Google Cloud Platform is a plus Experience with building data pipelines and getting the data you need to build and evaluate your models, using tools like Apache Beam / Spark is a plus"
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Bachelor's degree in Computer Science, Computer Engineering, relevant technical field, or equivalent practical experience. Preferred Qualifications Masters degree or PhD in Computer Science or a related technical field",
            "Experience": "8+ years of experience in software engineering, or a relevant field. 4+ years of experience if you have a PhD 6+ years of experience in one or more of the following areas: machine learning, recommendation systems, pattern recognition, data mining, artificial intelligence, or related technical field Experience with scripting languages such as Python, Javascript or Hack Experience leading major initiatives successfully Experience building and shipping high quality work and achieving high reliability Experience with developing machine learning models at scale from inception to business impact Knowledge developing and debugging in C/C++ and Java, or experience with scripting languages such as Python, Perl, PHP, and/or shell scripts Experience demonstrating technical leadership working with teams, owning projects, defining and setting technical direction for projects Experienced in utilizing data and analysis to explain technical problems and providing detailed feedback and solutions",
            "Skills": "Ability to own the whole ML life cycle, define projects and drive excellence across teams. Adapt standard machine learning methods to best exploit modern parallel environments (e.g., distributed clusters, multicore SMP, and GPU) Develop highly scalable classifiers and tools leveraging machine learning, data regression, and rules based models Code deliverables in tandem with the engineering team",
            "Projects": "Re-evaluate the tradeoffs of already shipped features/ML systems, and you are able to drive large efforts across multiple teams to reduce technical debt, designing from first principles when appropriate. Leading a team from a technical perspective to develop ML best practices and influence engineering culture Be a go-to person to escalate the most complex online/production performance and evaluation issues, that require an in depth knowledge of how the machine learning system interacts with systems around it. Suggest, collect and synthesize requirements and create effective feature roadmap"
        },
        "job_description": {
            "Role": "Machine Learning Engineer | Facebook October 2019 - Present (4 years) Developed and deployed machine learning models for user engagement prediction, resulting in a 20% increase in targeted content delivery effectiveness. Utilized PyTorch to implement deep learning algorithms for image processing, improving recognition accuracy by 30%. Collaborated with data engineering teams to establish a robust data pipeline using Apache Kafka, enhancing real-time data processing capabilities. Data Scientist | LinkedIn June 2017 - September 2019 (2 years, 3 months) Built and tested predictive models to optimize ad targeting, leading to a 25% boost in click-through rates. Conducted A/B testing on new features, analyzing user behavior to inform product decisions and improve user engagement metrics. Developed dashboards in Tableau to visualize key performance indicators, providing necessary insights for stakeholders. Data Science Intern | Expedia Group June 2016 - May 2017 (1 year) Assisted in building models to predict customer churn, which helped in formulating retention strategies that reduced churn rates by 15%. Implemented machine learning algorithms for demand forecasting, resulting in better inventory allocation and management. Engaged in exploratory data analysis using Python and R to identify trends and generate actionable insights from customer data.",
            "Qualification": "Education: Master of Science in Data Science, University of Washington (2017-2019). Bachelor of Science in Statistics, University of California, Berkeley (2013-2017). Skills: R, SQL, Machine Learning (Supervised & Unsupervised), TensorFlow, PyTorch, Apache Kafka, Tableau, Feature Engineering, and A/B Testing."
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Ph.D. in Computer Science, Stanford University (2016-2020). Bachelor of Science in Electrical Engineering, Massachusetts Institute of Technology (2012-2016).",
            "Experience": "Machine Learning Research Scientist | Google Research 2020 - Present    Developed cutting-edge reinforcement learning algorithms applied to robotic control, achieving a 50% increase in efficiency in simulated environments. Led a project applying deep learning for image recognition tasks, improving classification accuracy by 35% in internal benchmarks. Published research papers on novel architectures in top-tier AI conferences and collaborated with interdisciplinary teams to drive product innovation.  Machine Learning Engineer | NVIDIA 2017 - 2020    Designed and implemented a scalable image processing pipeline utilizing Apache Spark, significantly reducing processing times for large datasets. Collaborated with product teams to integrate state-of-the-art computer vision models in real-time applications, improving performance and user experience. Conducted thorough model evaluations and optimizations using Keras, enhancing model speed by 40% without sacrificing accuracy.  Data Analyst Intern | Salesforce 2015 - 2016    Analyzed customer data to develop predictive models for sales forecasting, improving inventory management by 15%. Created interactive data visualizations and dashboards that provided insights into customer trends, driving data-driven decision-making. Implemented NLP techniques to analyze customer feedback, providing actionable insights that enhanced product development strategies.",
            "Skills": "Machine Learning Tools: TensorFlow, Keras, scikit-learn Programming Languages: Python, Java, SQL, C++ Data Analysis & Visualization: Pandas, NumPy, Matplotlib, Seaborn Big Data Technologies: Apache Hadoop, Google Cloud",
            "Projects": ""
        },
        "job_description": {
            "Role": "As a Google Research Scientist, you'll actively contribute to the wider research community by sharing and publishing your findings, with ideas inspired by internal projects as well as from collaborations with research programs at partner universities and technical institutes all over the world. Author research papers to share and generate impact of research results across the team and in the research community. Help in growing research business across teams by sharing research trends and best practices within the community. Define the data structure, framework, design, and evaluation metrics for research solution development and implementation under minimal guidance. Identify timelines and obtain resources needed. Identify new and upcoming research areas by interacting with potential external and internal collaborators. Help in developing long-term research strategy and plans to expand the impact of Google research with some guidance. Contribute to conducting experiments based on the research question. Develop research prototypes or conduct simulations to further evaluate the impact of research, finalize hypotheses, and refine the research methodology under minimal guidance.",
            "Qualification": "Minimum qualifications: PhD degree in Computer Science, a related field, or equivalent practical experience. One or more scientific publication submission(s) for conferences, journals, or public repositories. Coding experience in Python, JavaScript, R, Java, or C++. Preferred qualifications: 2 years of coding experience in Python, JavaScript, R, Java, or C++. 1 year of experience owning and initiating research agendas."
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Master of Science in Artificial Intelligence, Carnegie Mellon University (2015-2017). Bachelor of Science in Mathematics, University of Texas at Austin (2011-2015).",
            "Skills": "Python, Scikit-learn, PyTorch, NumPy, SQL, TensorFlow, Time Series Analysis, Docker, and Git.",
            "Experience": "Senior Machine Learning Engineer, Amazon November 2019 - Present. Designed and implemented a recommendation system that increased user engagement by 30% through personalized content delivery. Developed advanced NLP models using PyTorch that improved sentiment analysis accuracy by 25%. Led a team initiative to migrate ML models to AWS, enhancing scalability and reducing operational costs by 20%. Conducted model performance evaluations, optimizing algorithms using Scikit-learn, resulting in a 15% reduction in prediction errors. Machine Learning Engineer, IBM: June 2017 - October 2019. Created predictive maintenance models for industrial machines that decreased unscheduled downtime by 40%. Collaborated on research projects applying deep learning techniques for image classification, achieving state-of-the-art results in benchmark datasets. Developed and deployed containerized machine learning pipelines using Docker, streamlining the model deployment process. Data Scientist Intern, Microsoft: June 2016 - May 2017. Assisted in analyzing large datasets to fine-tune machine learning models for Microsoft Azure’s cognitive services. Conducted exploratory data analysis using SQL and Python to uncover insights that informed product feature enhancements. Contributed to the development of an interactive dashboard for visualizing user behavior metrics, improving reporting efficiency.",
            "Projects": ""
        },
        "job_description": {
            "Role": "As a Senior Machine Learning Engineer at Amazon, you will design and implement cutting-edge machine learning solutions to enhance our core products and services. You will work collaboratively with cross-functional teams, including data scientists, software engineers, and product managers, to leverage large datasets and advanced algorithms to solve complex problems and drive innovation.  * Design, develop, test and deploy inference solutions for high-end LLMs * Create solutions that facilitate the usage and building of artificial intelligence workflows and optimize them for cost and latency. * Design and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry. * Build solutions on top of AWS that are easy to use for customers, scalable, fault-tolerant and great to manage. * Collaborate with cross-functional teams of engineers and scientists to identify and solve complex problems in GenAI * Mentor and guide junior engineers, and contribute to the overall growth and development of the team * Perform on-call duty to ensure an exceptionally frictionless experience for customers.",
            "Qualification": "BASIC QUALIFICATIONS: * 5+ years of non-internship, professional software development experience * 5+ years of programming with at least one modern language such as Java, C++, or C# including object-oriented design experience * Experience leading the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems * Experience building complex software systems that have been successfully delivered to customers * Solid knowledge of Machine Learning algorithms and techniques * Experience as a mentor, tech lead or leading an engineering team  PREFERRED QUALIFICATIONS * Masters's degree in computer science or equivalent * 5+ years of experience of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience * Experience working with transformer architectures, inference optimization technics and Large Language Models * Excellent problem-solving skills, with the ability to think creatively and critically about complex problems * Strong communication and collaboration skills, with the ability to work effectively with cross-functional teams"
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Bachelor of Science, Computer Science, University of Michigan (2020-current), Ann Arbor, MI",
            "Skills": "Microsoft Office, Google Workspace, Jupyter, Matplotlib, Pandas, TensorFlow",
            "Experience": "Data Entry Specialist, Cofactor Genomics (2022-Current), Ann Arbor, MI: Collaborated with bioinformaticians to preprocess and clean raw sequencing data, reducing preprocessing time. Developed and maintained a data tracking system, improving data traceability and lowering data loss incidents. Participated in data clean-up initiatives, resolving and consolidating duplicate records to decrease data redundancy. Designed automated data validation scripts using Python and Pandas, significantly reducing manual error checks and accelerating data entry speed.",
            "Projects": "ImageRecog (2022): Built interactive Jupyter notebooks with embedded code cells for real-time model demonstrations. Implemented a deep learning model using TensorFlow, achieving a high accuracy rate in object recognition. Incorporated error analysis and confusion matrix visualization in presentations to aid classmates in understanding model limitations. Created data visualizations using Matplotlib to illustrate the project's dataset distribution. Be A Tech Savvy Community Volunteer (2021): Conducted weekly one-on-one training sessions for seniors, resulting in a significant improvement in their ability to use technology. Led Microsoft Office workshops, teaching specialized skills. Assisted seniors in setting up email accounts and Google Workspace accounts, enhancing their online security."
        },
        "job_description": {
            "Role": "As a Data Entry Specialist at Cofactor Genomics, you will play a critical role in managing and organizing data related to genomic sequencing and analysis. Your primary responsibilities will include inputting, updating, and maintaining accurate data records, ensuring data integrity, and supporting the overall data management processes within the organization. Accurately enter and update genomic and customer information into databases and tracking systems, ensuring high levels of data integrity and accuracy. Review and verify data for completeness and correctness, identifying any discrepancies or errors that need to be resolved. Collaborate with laboratory and research teams to gather necessary data and ensure it is logged in a timely manner. Generate reports and summaries as needed to support project management and decision-making processes. Assist in the development and implementation of data management policies and procedures to optimize workflow and data quality. Maintain confidentiality of sensitive information in compliance with company policies and regulatory requirements. Perform routine data audits to identify and rectify any data inconsistencies or issues. Provide support for additional administrative tasks as needed, supporting various teams within Cofactor Genomics.",
            "Qualification": "Bachelor’s degree or equivalent work experience in a related field; experience in the life sciences or genomics is a plus. Proven experience in data entry or data management roles, with a strong attention to detail and accuracy. Proficient in data entry software and database management systems, with strong skills in Microsoft Excel and other relevant tools. Excellent organizational skills and the ability to manage multiple tasks under tight deadlines. Strong communication skills, with the ability to collaborate effectively with colleagues across departments. Familiarity with laboratory environments and processes is a plus. Ability to work independently as well as part of a team."
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Bachelor of Science in Computer Science, University of California, San Diego (2013-2017).",
            "Skills": "Pandas, Featuretools, TensorFlow, K-Means, NLTK, OpenCV, Keras, GridSearchCV, Flask, and FairML.",
            "Experience": "Machine Learning Architect, Hulu: November 2019 - Present    Developed an OpenCV-powered video analysis tool resulting in a substantial reduction of content classification time. Created a GridSearchCV framework to optimize hyperparameters, leading to improved model performance. Engineered a Flask-based REST API that increased back-end efficiency and reduced load times. Integrated FairML principles, significantly reducing bias in viewer prediction models  Junior Machine Learning Engineer, ServiceNow: August 2017 - October 2019    Co-developed a chatbot that improved customer service response times. Trained a GAN to generate synthetic data, resulting in significant cost savings. Developed a predictive maintenance model that decreased unplanned downtime. Implemented an anomaly detection system that reduced false positive alerts and improved response times.  Machine Learning Intern, Illumina: June 2016 - August 2017    Automated data cleaning for next-generation sequencing, saving considerable time. Used K-Means clustering to efficiently identify genetic markers. Leveraged NLTK for sentiment analysis, improving the accuracy of customer satisfaction trend recognition. Performed exploratory data analysis using Pandas, leading to an increase in the detection of high-risk genetic profiles.",
            "Projects": ""
        },
        "job_description": {
            "Role": "You will play a major part in building next generation Large Language Models(LLM's) for Enterprise Language Generation that will power NOW platform with AI experiences in day to day work of our customers. We are just getting started with our early-adopter customers and we need your help in building and making available an amazing range of solutions to our 9k+ enterprise customers around the world.  Confronted with real-world challenges and datasets, you will need to use your AI/ML expertise and creativity to apply existing methods and develop new ones to solve these problems in a practical and scalable way. Research, propose and implement appropriate models/techniques for LLM benchmarking. Participate in data collection and synthetic data generation, and generate custom benchmarks to evaluate diverse LLMs capabilities. Collaborate daily with a team of like-minded developers, applied research scientists, product managers and quality engineers to produce quality software. Contribute to the implementation of tools to facilitate LLMs evaluation and perform model / error analysis. Develop innovative patentable ideas that ensure the competitiveness of this product within the domain of similar work being done in the industry. Potentially write research papers in collaboration with our Research Group, to be published to the most notorious AI Conferences. Work with product owners to understand detailed requirements and own your code from design, implementation, testing and delivery of high-quality & high-impact solutions to our users.",
            "Qualification": "6+ years of relevant experience with a Bachelor's degree; or 4 years with a Master's degree; or a PhD with no experience; or equivalent work experience. Solid expertise in Python. Solid Machine Learning / Deep Learning theoretical knowledge and hands-on experience. Experience with LLM benchmarking and evaluation is required; experience generating synthetic data is a plus. Ability to read and experiment with ideas from recent research papers. High level of creativity, quick problem-solving abilities, and adaptability. Effective communication skills to convey research findings to both technical and non-technical stakeholders, ensuring a clear understanding of the benefits and limitations of LLMs across the organization."
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Master's Degree in Condensed Matter and Materials Physics, University of Ottawa (September 2020 - September 2023) Bachelor of Applied Science (B.A.Sc.) in Physics and Computer Science, McGill University (2016 - 2019) Bachelor of Applied Science (B.A.Sc.), Vanier College (2014 - 2016)",
            "Experience": "Machine Learning Specialist, Updata (October 2023 - Present, Montreal, Quebec, Canada) Specialized in developing and optimizing machine learning solutions for diverse industries. Visiting Scholar, National Research Council Canada (September 2020 - November 2023, Ottawa, Ontario, Canada) Researched neural network applications for materials design. ML Engineering Intern, Cash App (May 2022 - January 2023) Designed and implemented scalable machine learning models for fraud detection. Developed end-to-end machine learning pipelines and employed self-supervised learning methods to enhance efficiency. Bootcamp Instructor, University of Toronto, A3MD (September 2021) Taught PostgreSQL and database management for the Molar Database. Tutor, Nimbus Tutoring (January 2018 - January 2020, Montreal, Quebec, Canada) Provided tutoring services in physics and computer science. Research Intern, McGill Space Institute (January 2019 - September 2019) Assisted in discovering and analyzing the morphology of Fast Radio Bursts. Student Intern, McGill University - Medical Physics (May 2018 - September 2018) Engaged in medical physics research and analysis.",
            "Skills": "Machine Learning: Graph Neural Networks (GNNs), Generative Adversarial Networks (GANs), FastText Programming: Python, SQL, Prefect Dataflow Automation Tools: Azure Databricks, PostgreSQL Languages: English (Native), French (Full Professional), Hebrew (Professional Working)",
            "Projects": "Fraud Detection Models, Cash App Developed large-scale machine learning models and pipelines to process and analyze millions of records efficiently. Utilized FastText for embedding customer history into vector representations. Materials Design with Neural Networks, National Research Council Canada Applied GNNs and GANs for the design of novel materials in energy storage. Molar Database, University of Toronto Built and instructed on a PostgreSQL-based database for material science research."
        },
        "job_description": {
            "Role": "Design, develop, and maintain machine learning pipelines for internal and client-driven projects. Deploy machine learning models, including pre-trained models (e.g., LLMs), into production environments and ensure scalability and performance. Collaborate with data scientists to translate models into production-ready systems that meet business requirements. Optimize and tune machine learning models for performance, reliability, and cost-efficiency. Integrate machine learning models with cloud platforms and other infrastructure (e.g., AWS, GCP, Azure). Implement model monitoring, logging, and maintenance systems to ensure continuous operation and improvement of deployed models. Work closely with software engineering teams to ensure seamless model integration into larger applications. Stay up to date with the latest advancements in machine learning engineering, infrastructure, and deployment technologies.",
            "Qualification": "Bachelor’s or Master’s degree in Computer Science, Engineering, Data Science, or a related field. Ph.D. is a plus. 3+ years of experience in machine learning engineering, software engineering, or a related role. Strong programming skills in Python, Java, or similar languages, with proficiency in ML frameworks such as TensorFlow, PyTorch, or Scikit-learn. Hands-on experience with deploying pre-trained models, such as Large Language Models (LLMs), into production environments. Experience with cloud platforms (AWS, GCP, Azure) and containerization technologies (Docker, Kubernetes). Solid understanding of data pipelines, ETL processes, and version control systems (e.g., Git). Experience in building scalable, distributed systems and optimizing machine learning models for performance. Familiarity with MLOps tools and practices, including model versioning, monitoring, and CI/CD pipelines. Strong communication skills and ability to collaborate with cross-functional teams, including data scientists and engineers."
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Sheffield Hallam University: Bachelor of Arts in Sports Studies.",
            "Experience": "Senior Recruitment Consultant at Forsyth Barnes (September 2024 - Present): Partners with consumer-facing organizations globally to recruit top-tier data professionals for senior to executive roles. Focused on creating bespoke solutions tailored to specific hiring needs while supporting innovative brands in industries such as retail, fashion, and FMCG. Senior Consultant at Thor Companies (May 2023 - May 2024): Specialized in technical recruitment in Brooklyn, New York. Senior Associate at Thor Companies (May 2020 - May 2023): Managed high-quality candidate delivery and client business development across Europe. Associate at Thor Companies (August 2019 - May 2020): Worked within Scandinavia-focused recruitment, leveraging a mix of British proactiveness and Scandinavian efficiency.",
            "Skills": "Proficient in sales presentations, outbound sales, and recruitment strategies. Industry expertise in consumer-facing sectors, including retail, travel, gaming, and web services. Language proficiencies include English.",
            "Projects": ""
        },
        "job_description": {
            "Role": "Forsyth Barnes is partnered with one of the top global retailers, they are currently looking to overhaul their data science and machine learning functions, and they are searching for a strong LLM developer to support a new project all around their Generative AI platform.",
            "Qualification": "• Project Experience working with LLM, Hugging Face, OpenAI/Gemini API • Strong Exposure to building Rag Systems and frameworks • Highly skilled in Writing production codes • Has deployed models into production previously • Any retail experience would be a nice to have for this role • Excellent communication and presentation skills"
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Birla Institute of Technology and Science, Pilani Master's degree in Data Science (January 2018 - December 2019) Thadomal Shahani Engineering College Bachelor of Engineering (B.E) in Electronics and Telecommunication (2009 - 2013)",
            "Experience": "Senior AI/ML Engineer at Bitstrapped (September 2024 - Present) Exit Level Senior Manager - Senior Data Scientist at Morgan Stanley (June 2020 - April 2024) Senior Full Stack Software Developer at Morgan Stanley (January 2020 - May 2020) Consultant - Senior Full Stack Software Developer at Deloitte India (August 2016 - September 2018) Business Technology Analyst - Full Stack Software Developer at Deloitte India (January 2014 - July 2016) CEO - Technology Specialist at BRIMATEC LIMITED (July 2013 - November 2013)",
            "Skills": "Technical: Generative AI, Google Cloud Platform (GCP), Software Deployment, C#, SQL, PEGA, Machine Learning, AI, Natural Language Processing. Languages: French, Hindi, English, Marathi. Certifications: Exam 70-461: Querying Microsoft SQL Server 2012/2014. Certified Pega System Architect 7.2.",
            "Projects": "Fraud Prevention in Wealth Management (Morgan Stanley) Developed risk scoring models for check and wire transactions. Created client riskiness models and AI solutions like LLMOps and Whisper for Speech AI. Focused on fraud coverage, explainability, and advanced analytics. Advanced Automation Team (Morgan Stanley) Led projects to optimize bot performance for fraud investigations and trading settlements. Genetic Disease Screening Program (GDSP) (Deloitte India) Developed web applications for early diagnosis and disease management. Integrated Health Insurance Portal (Kynect) (Deloitte India) Optimized navigation frameworks and database performance for the Obamacare initiative."
        },
        "job_description": {
            "Role": "Develop, train, and deploy machine learning models on Google Cloud Platform (GCP), leveraging tools such as VertexAI, GenApp Builder, PalmApi and BigQueryML. Collaborate with cross-functional teams to gather requirements, define project goals, and design scalable machine learning architectures. Conduct data preprocessing, feature engineering, and model evaluation to ensure high-quality and reliable models. Implement and optimize machine learning algorithms and pipelines to handle large-scale text-based datasets. Explore and experiment with generative AI techniques, including large language models, to solve complex text-related problems. Monitor and maintain deployed models, ensuring performance, scalability, and reliability in production environments. Stay up-to-date with the latest advancements in machine learning, generative AI, and text-based models, and proactively propose innovative solutions to enhance existing systems.",
            "Qualification": "Bachelor's or advanced degree in Computer Science, Engineering, or a related field. Strong experience in machine learning engineering, with a focus on developing and deploying models in production environments. Proficiency in using Google Cloud Platform (GCP) tools and services for machine learning, such as Vertex AI, BigQuery, and TensorFlow. Solid understanding of deep learning architectures, natural language processing (NLP), and generative AI models, particularly in the text domain. Proficiency in Python and experience with relevant libraries and frameworks, such as TensorFlow, PyTorch, or Keras. Experience with data preprocessing, feature engineering, and model evaluation techniques for text-based datasets. Familiarity with MLOps practices, version control, and CI/CD pipelines for machine learning. Strong problem-solving skills and the ability to work on complex projects independently or collaboratively. Excellent communication skills, with the ability to convey complex technical concepts to both technical and non-technical stakeholders. Experience with large language models, such as GPT-3, BERT, or Transformer-based models. Familiarity with cloud-based machine learning services and technologies, beyond Google Cloud Platform. Knowledge of scalable distributed computing frameworks, such as Apache Spark or Hadoop. Contributions to open-source machine learning projects or research publications in the field."
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "University of Ottawa: Master of Computer Science with a specialization in Applied Artificial Intelligence (August 2022 - June 2024). National Institute of Technology Karnataka: Bachelor of Technology in Computer Engineering (2016 - 2020).",
            "Experience": "Machine Learning Engineer at GPTZero (June 2024 - Present): Applies cutting-edge machine learning techniques to deliver AI-driven solutions in Toronto. Machine Learning Developer at Kinaxis (September 2023 - December 2023): Developed supply chain solutions using graph machine learning algorithms and reinforcement learning to improve operational performance by ~30x. NLP Researcher at National Research Council Canada (May 2023 - September 2023): Conducted research on keyphrase generation and proposed innovative model architectures, leading to state-of-the-art results published in NAACL 2024 and LREC-COLING 2024. Data Scientist at Oracle (May 2021 - September 2022): Built large-scale object detection models and improved OCR models for document recognition. Contributed to OCI Vision Services and Language Services, achieving significant efficiency and accuracy improvements. Full-stack Developer at Morgan Stanley (May 2019 - July 2019): Designed and implemented a web-based books and records management system, incorporating NLP features for enhanced search capabilities.",
            "Skills": "Proficient in Python, TensorFlow, PyTorch, MATLAB, and Graph Neural Networks. Experienced in machine learning, computer vision, NLP, and MLOps. Published researcher in AI conferences.",
            "Projects": "Multi-Res-Attention UNet: Developed a CNN model for segmenting focal cortical dysplasia lesions from MRI images. Achieved performance gains of over 5% with ~50% fewer parameters compared to baseline approaches. DICE Clustering Engine: Proposed and implemented an intelligent clustering engine for uniformly partitioning directed graphs, enhancing supply chain operations. Absent Keyphrase Generation: Designed a permutation-invariant Transformer Decoder with improved attention mechanisms, achieving state-of-the-art results in keyphrase generation tasks."
        },
        "job_description": {
            "Role": "Design, train, and fine-tune state-of-the-art language models • Develop AI agents combined with retrieval-augmented language models • Build efficient and scalable ML training and inference systems • Stay up-to-date with the latest literature and emerging technologies to solve novel problems • Work closely with product and design teams to develop intuitive applications that create societal impact",
            "Qualification": "4+ YOE in PyTorch/Transformers • 1st author in paper at top-tier conference or led a significant ML project in industry • Experience pushing the cutting-edge in machine learning • Self-starter (pitch, plan, and implement as a project owner in a fast-paced team) • Highly motivated to make positive societal impact • Ability to wear multiple hats and be a leader as our team grows • Visa for work in Canada Bonus: • strong open-source portfolio • publications at top-tier ML venues • experience working in an early-stage startup environment  • understanding of how machine learning models fail in the wild"
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Stanford University: Master’s Degree in Statistics (September 2022 - December 2023). University of Toronto: Bachelor of Science in Mathematics and Statistics (2017 - 2021).",
            "Experience": "Machine Learning Engineer at Affirm (March 2024 - Present): Applies machine learning techniques to drive innovative solutions. International Banking Analytics Co-op Student at Scotiabank (January 2022 - August 2022): Created customer segments, adjusted rate recommendations, and analyzed sales data using decision trees, logistic regression, and random forests. Forecasted quotation volume using time series analysis. Enterprise Stress Testing Analyst at Scotiabank (September 2021 - December 2021): Refined R Shiny apps for interactive economic data visualization, automated variable additions, and created user manuals. Risk Associate Intern at CIBC (May 2020 - August 2020): Automated reporting processes using Excel VBA, built reports on counterparty exposures, and participated in a business challenge competition. Data Analyst Assistant at Ontario Ministry of Training, Colleges, and Universities (May 2019 - August 2019): Web-scraped data, formatted and uploaded it to SQL databases, and created video tutorials and surveys for ministry tools. QA Intern at RPM Technologies (May 2018 - August 2018): Conducted software testing, created test plans, trained quality assurance analysts, and documented results.",
            "Skills": "Proficient in Python, R, SQL, Tableau, and Excel VBA. Experienced in machine learning (decision trees, random forests, time series), data visualization, and statistical modeling. Certifications include Tableau Analyst and Canadian Securities Course.",
            "Projects": ""
        },
        "job_description": {
            "Role": "• Use Affirm’s proprietary and other third party data to develop machine learning models that predict the likelihood of default and make an approval or decline decision to achieve business objectives • Partner with platform and product engineering teams to build model training, decisioning, and monitoring systems • Research ground breaking solutions and develop prototypes that drive the future of credit decisioning at Affirm • Implement and scale data pipelines, new features, and algorithms that are essential to our production models • Collaborate with the engineering, credit, and product teams to define requirements for new products",
            "Qualification": "• 8+ years of experience as a machine learning engineer. Relevant PhD can count for up to 2 YOE • Experience developing machine learning models at scale from inception to business impact • Proficiency in machine learning with experience in areas such as Generalized Linear Models, Gradient Boosting, Deep Learning, and Probabilistic Calibration • Strong engineering skills in Python and data manipulation skills like SQL • Experience using large scale distributed systems like Spark or Ray • Experience using open source projects and software, such as scikit-learn, pandas, NumPy, XGBoost, PyTorch, Kubeflow • Experience with Kubernetes, Docker, and Airflow is a plus • Excellent written and oral communication skills and the capability to drive cross-functional requirements with product and engineering teams • Persistence, patience and a strong sense of responsibility – we build the decision making that enables consumers and partners to place their trust in Affirm"
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "University of Manitoba: Bachelor of Science in Computer Science (2014 - 2019).",
            "Experience": "Senior Machine Learning Software Developer at Primate Labs Inc. (May 2023 - Present): Researches, designs, and develops machine learning benchmark tests to measure the performance of mobile neural network accelerators. Works with APIs like NNAPI on Android and CoreML on iOS, and applies ML applications such as facial recognition and object classification. Machine Learning Software Developer at Primate Labs Inc. (February 2020 - May 2023): Focused on machine learning applications and communicated results internally and externally to hardware and platform vendors. Deep Learning & Computer Vision Researcher at University of Manitoba (September 2018 - August 2019): Conducted research on video technology combined with ConvLSTM for high-performance network adjustments, resulting in a publication at the IEEE 21st International Workshop on Multimedia Signal Processing. Robotics Motion Developer at University of Manitoba (September 2017 - September 2018): Worked on object classification and detection using OpenCV and ROS, integrated robotic motions and visions, and prepared robots for FIRA RoboCup 2018. Teaching Assistant at International College of Manitoba (May 2018 - June 2019): Conducted lab sessions on programming concepts in Java and Python, graded assignments, and supported 120 students through lab sessions.",
            "Skills": "Proficient in Python, Java, C++, and C. Experienced in machine learning, computer vision, and robotics development with tools like PyTorch, OpenCV, and ROS. Language proficiencies include English (Full Professional) and Chinese (Full Professional).",
            "Projects": "Wandering Messenger Pigeon Chatting System (January 2019 - May 2019): Designed and developed a chatting system with Google Cloud Platform as the server and Firestore as the database. Used Vue.js for the website and React Native for mobile development."
        },
        "job_description": {
            "Role": "As a Machine Learning Software Developer, your primary responsibility will be to investigate and develop machine learning benchmarks. The benchmarks include both computer vision AI models (e.g., Object Detection, Image Segmentation) and generative AI models (e.g., LLMs such as LLaMA, text-to-image models such as Stable Diffusion). The benchmark tests will target high-end mobile devices and desktop systems. You will also be responsible for communicating experimental results from the benchmark tests both internally to project stakeholders and externally to representatives from hardware companies.",
            "Qualification": "The ideal candidate has the following background and skills: • Experience with C++ and Python. • Experience with at least one machine learning toolkit (e.g., TensorFlow, PyTorch). • An understanding of neural networks and how they work. • Strong written and oral communication skills. • Able to work independently with minimal supervision. • Able to conduct research and problem solve independently The following skills are nice to have but are not necessary: • An understanding of generative AI models (e.g., LLMs, Stable Diffusion) • Experience working with a variety of operating systems (e.g., Linux, Windows, macOS). • Experience training deep learning models."
        }
    },
    {
        "job_title": "MLE",
        "resume": {
            "Education": "Slovenská technická univerzita v Bratislave: Master’s Degree in Software Engineering (2006 - 2008). Universität Leipzig: Socrates/Erasmus Exchange Program (2007 - 2008). Slovenská technická univerzita v Bratislave: Bachelor’s Degree in Software Engineering (2002 - 2006).",
            "Experience": "Staff ML Engineer at Lyft (June 2024 - Present): Leads machine learning engineering initiatives in Toronto. Senior Machine Learning Software Engineer at RBC Borealis (August 2021 - June 2024): Worked on advanced ML software engineering projects. Senior Machine Learning Engineer | ML Platform Architect at Jumio Corporation (September 2018 - May 2021): Architected and implemented ML platforms for efficient deployment and scaling of machine learning models. Machine Learning Researcher at Slovenská technická univerzita v Bratislave (September 2017 - August 2018): Conducted research in machine learning and its applications. Site Reliability Engineer at Google (September 2014 - April 2017): Focused on ensuring the reliability and efficiency of Google’s large-scale systems. Software Developer in R&D at ESET (May 2009 - December 2011): Contributed to research and development of software solutions. Consultant roles at .yttro s.r.o. and rapid Systems (2008 - 2014): Provided software and system consultation services. Research Assistant at Max Planck Institute for Human Cognitive and Brain Sciences (October 2007 - February 2008): Assisted in cognitive and brain sciences research.",
            "Skills": "Proficient in machine learning, ML platform architecture, and software development. Experienced in SIMD, Atmel AVR, and technical leadership. Language proficiencies include Slovak (Native or Bilingual), Hungarian (Native or Bilingual), English (Professional Working), and German (Professional Working). Certifications include Machine Learning, Convolutional Neural Networks, and Neural Networks for Machine Learning.",
            "Projects": ""
        },
        "job_description": {
            "Role": "Partner with Engineers, Data Scientists, Product Managers, and Business Partners to apply machine learning for business and user impact • Perform data analysis and build proof-of-concept to explore and propose ML solutions to both new and existing problems • Be able to make effective tradeoffs between model accuracy and its productization complexity and runtime performance.  • Develop statistical, machine learning, or optimization models • Write production quality code to launch machine learning models that can scale well to serve millions of requests per day • Evaluate machine learning systems against business goals • Participate in code reviews, design reviews, production on-call support and incident triaging process • Write well-crafted, well-tested, readable, maintainable code",
            "Qualification": "B.S., M.S., or Ph.D. in Computer Science or other quantitative fields or related work experience • 3+ years of Machine Learning experience • Passion for building impactful machine learning models leveraging expertise in one or multiple fields. • Proficiency in Python, Golang, or other programming language • Excellent communication skills and fluency in English • Strong understanding of Machine Learning methodologies, including supervised learning, forecasting, recommendation systems, reinforcement learning, and multi-armed bandits"
        }
    }
]